podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// <h> Port B Pins

// Signal mapping for PTB0 pin
//   <o> PTB0 (Alias:A0) [LCD_P0/ADC0_SE8/TSI0_CH0, GPIOB_0/LLWU_P5, I2C0_SCL, TPM1_CH0, LCD_P0_fault]<name=PTB0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB0 pin
//     <-2=> LCD_P0/ADC0_SE8/TSI0_CH0 (reset default)<selection=LCD_P0_PIN_SEL,PTB0 (reset default)><selection=ADC0_SE8_PIN_SEL,PTB0 (reset default)><selection=TSI0_CH0_PIN_SEL,PTB0 (reset default)>
//     <0=> LCD_P0/ADC0_SE8/TSI0_CH0<selection=LCD_P0_PIN_SEL,PTB0><selection=ADC0_SE8_PIN_SEL,PTB0><selection=TSI0_CH0_PIN_SEL,PTB0>
//     <1=> GPIOB_0/LLWU_P5<selection=GPIOB_0_PIN_SEL,PTB0><selection=LLWU_P5_PIN_SEL,PTB0>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB0>
//     <3=> TPM1_CH0<selection=TPM1_CH0_PIN_SEL,PTB0>
//     <7=> LCD_P0_fault<selection=LCD_P0_fault_PIN_SEL,PTB0>
//     <0=> Default
#define PTB0_SIG_SEL         0

// Signal mapping for PTB1 pin
//   <o> PTB1 (Alias:A1) [LCD_P1/ADC0_SE9/TSI0_CH6, GPIOB_1, I2C0_SDA, TPM1_CH1, LCD_P1_fault]<name=PTB1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB1 pin
//     <-2=> LCD_P1/ADC0_SE9/TSI0_CH6 (reset default)<selection=LCD_P1_PIN_SEL,PTB1 (reset default)><selection=ADC0_SE9_PIN_SEL,PTB1 (reset default)><selection=TSI0_CH6_PIN_SEL,PTB1 (reset default)>
//     <0=> LCD_P1/ADC0_SE9/TSI0_CH6<selection=LCD_P1_PIN_SEL,PTB1><selection=ADC0_SE9_PIN_SEL,PTB1><selection=TSI0_CH6_PIN_SEL,PTB1>
//     <1=> GPIOB_1<selection=GPIOB_1_PIN_SEL,PTB1>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB1>
//     <3=> TPM1_CH1<selection=TPM1_CH1_PIN_SEL,PTB1>
//     <7=> LCD_P1_fault<selection=LCD_P1_fault_PIN_SEL,PTB1>
//     <0=> Default
#define PTB1_SIG_SEL         0

// Signal mapping for PTB2 pin
//   <o> PTB2 (Alias:A2) [LCD_P2/ADC0_SE12/TSI0_CH7, GPIOB_2, I2C0_SCL, TPM2_CH0, LCD_P2_fault]<name=PTB2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB2 pin
//     <-2=> LCD_P2/ADC0_SE12/TSI0_CH7 (reset default)<selection=LCD_P2_PIN_SEL,PTB2 (reset default)><selection=ADC0_SE12_PIN_SEL,PTB2 (reset default)><selection=TSI0_CH7_PIN_SEL,PTB2 (reset default)>
//     <0=> LCD_P2/ADC0_SE12/TSI0_CH7<selection=LCD_P2_PIN_SEL,PTB2><selection=ADC0_SE12_PIN_SEL,PTB2><selection=TSI0_CH7_PIN_SEL,PTB2>
//     <1=> GPIOB_2<selection=GPIOB_2_PIN_SEL,PTB2>
//     <2=> I2C0_SCL<selection=I2C0_SCL_PIN_SEL,PTB2>
//     <3=> TPM2_CH0<selection=TPM2_CH0_PIN_SEL,PTB2>
//     <7=> LCD_P2_fault<selection=LCD_P2_fault_PIN_SEL,PTB2>
//     <0=> Default
#define PTB2_SIG_SEL         0

// Signal mapping for PTB3 pin
//   <o> PTB3 (Alias:A3) [LCD_P3/ADC0_SE13/TSI0_CH8, GPIOB_3, I2C0_SDA, TPM2_CH1, LCD_P3_fault]<name=PTB3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB3 pin
//     <-2=> LCD_P3/ADC0_SE13/TSI0_CH8 (reset default)<selection=LCD_P3_PIN_SEL,PTB3 (reset default)><selection=ADC0_SE13_PIN_SEL,PTB3 (reset default)><selection=TSI0_CH8_PIN_SEL,PTB3 (reset default)>
//     <0=> LCD_P3/ADC0_SE13/TSI0_CH8<selection=LCD_P3_PIN_SEL,PTB3><selection=ADC0_SE13_PIN_SEL,PTB3><selection=TSI0_CH8_PIN_SEL,PTB3>
//     <1=> GPIOB_3<selection=GPIOB_3_PIN_SEL,PTB3>
//     <2=> I2C0_SDA<selection=I2C0_SDA_PIN_SEL,PTB3>
//     <3=> TPM2_CH1<selection=TPM2_CH1_PIN_SEL,PTB3>
//     <7=> LCD_P3_fault<selection=LCD_P3_fault_PIN_SEL,PTB3>
//     <0=> Default
#define PTB3_SIG_SEL         0

// Signal mapping for PTB7 pin
//   <o> PTB7 [LCD_P7, GPIOB_7, LCD_P7_fault]<name=PTB7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB7 pin
//     <-2=> LCD_P7 (reset default)<selection=LCD_P7_PIN_SEL,PTB7 (reset default)>
//     <0=> LCD_P7<selection=LCD_P7_PIN_SEL,PTB7>
//     <1=> GPIOB_7<selection=GPIOB_7_PIN_SEL,PTB7>
//     <7=> LCD_P7_fault<selection=LCD_P7_fault_PIN_SEL,PTB7>
//     <-2=> Default
#define PTB7_SIG_SEL         -2

// Signal mapping for PTB8 pin
//   <o> PTB8 [LCD_P8, GPIOB_8, SPI1_PCS0, EXTRG_IN, LCD_P8_fault]<name=PTB8_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB8 pin
//     <-2=> LCD_P8 (reset default)<selection=LCD_P8_PIN_SEL,PTB8 (reset default)>
//     <0=> LCD_P8<selection=LCD_P8_PIN_SEL,PTB8>
//     <1=> GPIOB_8<selection=GPIOB_8_PIN_SEL,PTB8>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTB8>
//     <3=> EXTRG_IN<selection=EXTRG_IN_PIN_SEL,PTB8>
//     <7=> LCD_P8_fault<selection=LCD_P8_fault_PIN_SEL,PTB8>
//     <-2=> Default
#define PTB8_SIG_SEL         -2

// Signal mapping for PTB9 pin
//   <o> PTB9 [LCD_P9, GPIOB_9, SPI1_SCK, LCD_P9_fault]<name=PTB9_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB9 pin
//     <-2=> LCD_P9 (reset default)<selection=LCD_P9_PIN_SEL,PTB9 (reset default)>
//     <0=> LCD_P9<selection=LCD_P9_PIN_SEL,PTB9>
//     <1=> GPIOB_9<selection=GPIOB_9_PIN_SEL,PTB9>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTB9>
//     <7=> LCD_P9_fault<selection=LCD_P9_fault_PIN_SEL,PTB9>
//     <-2=> Default
#define PTB9_SIG_SEL         -2

// Signal mapping for PTB10 pin
//   <o> PTB10 [LCD_P10, GPIOB_10, SPI1_PCS0, LCD_P10_fault]<name=PTB10_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB10 pin
//     <-2=> LCD_P10 (reset default)<selection=LCD_P10_PIN_SEL,PTB10 (reset default)>
//     <0=> LCD_P10<selection=LCD_P10_PIN_SEL,PTB10>
//     <1=> GPIOB_10<selection=GPIOB_10_PIN_SEL,PTB10>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTB10>
//     <7=> LCD_P10_fault<selection=LCD_P10_fault_PIN_SEL,PTB10>
//     <-2=> Default
#define PTB10_SIG_SEL        -2

// Signal mapping for PTB11 pin
//   <o> PTB11 [LCD_P11, GPIOB_11, SPI1_SCK, LCD_P11_fault]<name=PTB11_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB11 pin
//     <-2=> LCD_P11 (reset default)<selection=LCD_P11_PIN_SEL,PTB11 (reset default)>
//     <0=> LCD_P11<selection=LCD_P11_PIN_SEL,PTB11>
//     <1=> GPIOB_11<selection=GPIOB_11_PIN_SEL,PTB11>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTB11>
//     <7=> LCD_P11_fault<selection=LCD_P11_fault_PIN_SEL,PTB11>
//     <-2=> Default
#define PTB11_SIG_SEL        -2

// Signal mapping for PTB16 pin
//   <o> PTB16 [LCD_P12/TSI0_CH9, GPIOB_16, SPI1_MOSI, UART0_RX, TPM_CLKIN0, SPI1_MISO, LCD_P12_fault]<name=PTB16_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB16 pin
//     <-2=> LCD_P12/TSI0_CH9 (reset default)<selection=LCD_P12_PIN_SEL,PTB16 (reset default)><selection=TSI0_CH9_PIN_SEL,PTB16 (reset default)>
//     <0=> LCD_P12/TSI0_CH9<selection=LCD_P12_PIN_SEL,PTB16><selection=TSI0_CH9_PIN_SEL,PTB16>
//     <1=> GPIOB_16<selection=GPIOB_16_PIN_SEL,PTB16>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTB16>
//     <3=> UART0_RX<selection=UART0_RX_PIN_SEL,PTB16>
//     <4=> TPM_CLKIN0<selection=TPM_CLKIN0_PIN_SEL,PTB16>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTB16>
//     <7=> LCD_P12_fault<selection=LCD_P12_fault_PIN_SEL,PTB16>
//     <-2=> Default
#define PTB16_SIG_SEL        -2

// Signal mapping for PTB17 pin
//   <o> PTB17 [LCD_P13/TSI0_CH10, GPIOB_17, SPI1_MISO, UART0_TX, TPM_CLKIN1, SPI1_MOSI, LCD_P13_fault]<name=PTB17_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB17 pin
//     <-2=> LCD_P13/TSI0_CH10 (reset default)<selection=LCD_P13_PIN_SEL,PTB17 (reset default)><selection=TSI0_CH10_PIN_SEL,PTB17 (reset default)>
//     <0=> LCD_P13/TSI0_CH10<selection=LCD_P13_PIN_SEL,PTB17><selection=TSI0_CH10_PIN_SEL,PTB17>
//     <1=> GPIOB_17<selection=GPIOB_17_PIN_SEL,PTB17>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTB17>
//     <3=> UART0_TX<selection=UART0_TX_PIN_SEL,PTB17>
//     <4=> TPM_CLKIN1<selection=TPM_CLKIN1_PIN_SEL,PTB17>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTB17>
//     <7=> LCD_P13_fault<selection=LCD_P13_fault_PIN_SEL,PTB17>
//     <-2=> Default
#define PTB17_SIG_SEL        -2

// Signal mapping for PTB18 pin
//   <o> PTB18 [LCD_P14/TSI0_CH11, GPIOB_18, TPM2_CH0, I2S0_TX_BCLK, LCD_P14_fault]<name=PTB18_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB18 pin
//     <-2=> LCD_P14/TSI0_CH11 (reset default)<selection=LCD_P14_PIN_SEL,PTB18 (reset default)><selection=TSI0_CH11_PIN_SEL,PTB18 (reset default)>
//     <0=> LCD_P14/TSI0_CH11<selection=LCD_P14_PIN_SEL,PTB18><selection=TSI0_CH11_PIN_SEL,PTB18>
//     <1=> GPIOB_18<selection=GPIOB_18_PIN_SEL,PTB18>
//     <3=> TPM2_CH0<selection=TPM2_CH0_PIN_SEL,PTB18>
//     <4=> I2S0_TX_BCLK<selection=I2S0_TX_BCLK_PIN_SEL,PTB18>
//     <7=> LCD_P14_fault<selection=LCD_P14_fault_PIN_SEL,PTB18>
//     <-2=> Default
#define PTB18_SIG_SEL        -2

// Signal mapping for PTB19 pin
//   <o> PTB19 [LCD_P15/TSI0_CH12, GPIOB_19, TPM2_CH1, I2S0_TX_FS, LCD_P15_fault]<name=PTB19_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB19 pin
//     <-2=> LCD_P15/TSI0_CH12 (reset default)<selection=LCD_P15_PIN_SEL,PTB19 (reset default)><selection=TSI0_CH12_PIN_SEL,PTB19 (reset default)>
//     <0=> LCD_P15/TSI0_CH12<selection=LCD_P15_PIN_SEL,PTB19><selection=TSI0_CH12_PIN_SEL,PTB19>
//     <1=> GPIOB_19<selection=GPIOB_19_PIN_SEL,PTB19>
//     <3=> TPM2_CH1<selection=TPM2_CH1_PIN_SEL,PTB19>
//     <4=> I2S0_TX_FS<selection=I2S0_TX_FS_PIN_SEL,PTB19>
//     <7=> LCD_P15_fault<selection=LCD_P15_fault_PIN_SEL,PTB19>
//     <-2=> Default
#define PTB19_SIG_SEL        -2

// Signal mapping for PTB20 pin
//   <o> PTB20 [LCD_P16, GPIOB_20, CMP0_OUT, LCD_P16_fault]<name=PTB20_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB20 pin
//     <-2=> LCD_P16 (reset default)<selection=LCD_P16_PIN_SEL,PTB20 (reset default)>
//     <0=> LCD_P16<selection=LCD_P16_PIN_SEL,PTB20>
//     <1=> GPIOB_20<selection=GPIOB_20_PIN_SEL,PTB20>
//     <6=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTB20>
//     <7=> LCD_P16_fault<selection=LCD_P16_fault_PIN_SEL,PTB20>
//     <-2=> Default
#define PTB20_SIG_SEL        -2

// Signal mapping for PTB21 pin
//   <o> PTB21 [LCD_P17, GPIOB_21, LCD_P17_fault]<name=PTB21_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB21 pin
//     <-2=> LCD_P17 (reset default)<selection=LCD_P17_PIN_SEL,PTB21 (reset default)>
//     <0=> LCD_P17<selection=LCD_P17_PIN_SEL,PTB21>
//     <1=> GPIOB_21<selection=GPIOB_21_PIN_SEL,PTB21>
//     <7=> LCD_P17_fault<selection=LCD_P17_fault_PIN_SEL,PTB21>
//     <-2=> Default
#define PTB21_SIG_SEL        -2

// Signal mapping for PTB22 pin
//   <o> PTB22 [LCD_P18, GPIOB_22, LCD_P18_fault]<name=PTB22_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB22 pin
//     <-2=> LCD_P18 (reset default)<selection=LCD_P18_PIN_SEL,PTB22 (reset default)>
//     <0=> LCD_P18<selection=LCD_P18_PIN_SEL,PTB22>
//     <1=> GPIOB_22<selection=GPIOB_22_PIN_SEL,PTB22>
//     <7=> LCD_P18_fault<selection=LCD_P18_fault_PIN_SEL,PTB22>
//     <-2=> Default
#define PTB22_SIG_SEL        -2

// Signal mapping for PTB23 pin
//   <o> PTB23 [LCD_P19, GPIOB_23, LCD_P19_fault]<name=PTB23_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTB23 pin
//     <-2=> LCD_P19 (reset default)<selection=LCD_P19_PIN_SEL,PTB23 (reset default)>
//     <0=> LCD_P19<selection=LCD_P19_PIN_SEL,PTB23>
//     <1=> GPIOB_23<selection=GPIOB_23_PIN_SEL,PTB23>
//     <7=> LCD_P19_fault<selection=LCD_P19_fault_PIN_SEL,PTB23>
//     <-2=> Default
#define PTB23_SIG_SEL        -2

