podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// <h> Port D Pins

// Signal mapping for PTD0 pin
//   <o> PTD0 [LCD_P40, GPIOD_0, SPI0_PCS0, TPM0_CH0, LCD_P40_fault]<name=PTD0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD0 pin
//     <-2=> LCD_P40 (reset default)<selection=LCD_P40_PIN_SEL,PTD0 (reset default)>
//     <0=> LCD_P40<selection=LCD_P40_PIN_SEL,PTD0>
//     <1=> GPIOD_0<selection=GPIOD_0_PIN_SEL,PTD0>
//     <2=> SPI0_PCS0<selection=SPI0_PCS0_PIN_SEL,PTD0>
//     <4=> TPM0_CH0<selection=TPM0_CH0_PIN_SEL,PTD0>
//     <7=> LCD_P40_fault<selection=LCD_P40_fault_PIN_SEL,PTD0>
//     <-2=> Default
#define PTD0_SIG_SEL         -2

// Signal mapping for PTD1 pin
//   <o> PTD1 (Alias:MAG_INT, ACC_INT2, LED_BLUE) [LCD_P41/ADC0_SE5b, GPIOD_1, SPI0_SCK, TPM0_CH1, LCD_P41_fault]<name=PTD1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD1 pin
//     <-2=> LCD_P41/ADC0_SE5b (reset default)<selection=LCD_P41_PIN_SEL,PTD1 (reset default)><selection=ADC0_SE5b_PIN_SEL,PTD1 (reset default)>
//     <0=> LCD_P41/ADC0_SE5b<selection=LCD_P41_PIN_SEL,PTD1><selection=ADC0_SE5b_PIN_SEL,PTD1>
//     <1=> GPIOD_1<selection=GPIOD_1_PIN_SEL,PTD1>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTD1>
//     <4=> TPM0_CH1<selection=TPM0_CH1_PIN_SEL,PTD1>
//     <7=> LCD_P41_fault<selection=LCD_P41_fault_PIN_SEL,PTD1>
//     <4=> Default
#define PTD1_SIG_SEL         4

// Signal mapping for PTD2 pin
//   <o> PTD2 (Alias:D9) [LCD_P42, GPIOD_2, SPI0_MOSI, UART2_RX, TPM0_CH2, SPI0_MISO, LCD_P42_fault]<name=PTD2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD2 pin
//     <-2=> LCD_P42 (reset default)<selection=LCD_P42_PIN_SEL,PTD2 (reset default)>
//     <0=> LCD_P42<selection=LCD_P42_PIN_SEL,PTD2>
//     <1=> GPIOD_2<selection=GPIOD_2_PIN_SEL,PTD2>
//     <2=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD2>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD2>
//     <4=> TPM0_CH2<selection=TPM0_CH2_PIN_SEL,PTD2>
//     <5=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD2>
//     <7=> LCD_P42_fault<selection=LCD_P42_fault_PIN_SEL,PTD2>
//     <1=> Default
#define PTD2_SIG_SEL         1

// Signal mapping for PTD3 pin
//   <o> PTD3 (Alias:D2) [LCD_P43, GPIOD_3, SPI0_MISO, UART2_TX, TPM0_CH3, SPI0_MOSI, LCD_P43_fault]<name=PTD3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD3 pin
//     <-2=> LCD_P43 (reset default)<selection=LCD_P43_PIN_SEL,PTD3 (reset default)>
//     <0=> LCD_P43<selection=LCD_P43_PIN_SEL,PTD3>
//     <1=> GPIOD_3<selection=GPIOD_3_PIN_SEL,PTD3>
//     <2=> SPI0_MISO<selection=SPI0_MISO_PIN_SEL,PTD3>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD3>
//     <4=> TPM0_CH3<selection=TPM0_CH3_PIN_SEL,PTD3>
//     <5=> SPI0_MOSI<selection=SPI0_MOSI_PIN_SEL,PTD3>
//     <7=> LCD_P43_fault<selection=LCD_P43_fault_PIN_SEL,PTD3>
//     <1=> Default
#define PTD3_SIG_SEL         1

// Signal mapping for PTD4 pin
//   <o> PTD4 (Alias:D10) [LCD_P44, GPIOD_4/LLWU_P14, SPI1_PCS0, UART2_RX, TPM0_CH4, LCD_P44_fault]<name=PTD4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD4 pin
//     <-2=> LCD_P44 (reset default)<selection=LCD_P44_PIN_SEL,PTD4 (reset default)>
//     <0=> LCD_P44<selection=LCD_P44_PIN_SEL,PTD4>
//     <1=> GPIOD_4/LLWU_P14<selection=GPIOD_4_PIN_SEL,PTD4><selection=LLWU_P14_PIN_SEL,PTD4>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTD4>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTD4>
//     <4=> TPM0_CH4<selection=TPM0_CH4_PIN_SEL,PTD4>
//     <7=> LCD_P44_fault<selection=LCD_P44_fault_PIN_SEL,PTD4>
//     <1=> Default
#define PTD4_SIG_SEL         1

// Signal mapping for PTD5 pin
//   <o> PTD5 (Alias:D13, LED_GREEN) [LCD_P45/ADC0_SE6b, GPIOD_5, SPI1_SCK, UART2_TX, TPM0_CH5, LCD_P45_fault]<name=PTD5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD5 pin
//     <-2=> LCD_P45/ADC0_SE6b (reset default)<selection=LCD_P45_PIN_SEL,PTD5 (reset default)><selection=ADC0_SE6b_PIN_SEL,PTD5 (reset default)>
//     <0=> LCD_P45/ADC0_SE6b<selection=LCD_P45_PIN_SEL,PTD5><selection=ADC0_SE6b_PIN_SEL,PTD5>
//     <1=> GPIOD_5<selection=GPIOD_5_PIN_SEL,PTD5>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTD5>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTD5>
//     <4=> TPM0_CH5<selection=TPM0_CH5_PIN_SEL,PTD5>
//     <7=> LCD_P45_fault<selection=LCD_P45_fault_PIN_SEL,PTD5>
//     <4=> Default
#define PTD5_SIG_SEL         4

// Signal mapping for PTD6 pin
//   <o> PTD6 (Alias:D11) [LCD_P46/ADC0_SE7b, GPIOD_6/LLWU_P15, SPI1_MOSI, UART0_RX, SPI1_MISO, LCD_P46_fault]<name=PTD6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD6 pin
//     <-2=> LCD_P46/ADC0_SE7b (reset default)<selection=LCD_P46_PIN_SEL,PTD6 (reset default)><selection=ADC0_SE7b_PIN_SEL,PTD6 (reset default)>
//     <0=> LCD_P46/ADC0_SE7b<selection=LCD_P46_PIN_SEL,PTD6><selection=ADC0_SE7b_PIN_SEL,PTD6>
//     <1=> GPIOD_6/LLWU_P15<selection=GPIOD_6_PIN_SEL,PTD6><selection=LLWU_P15_PIN_SEL,PTD6>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD6>
//     <3=> UART0_RX<selection=UART0_RX_PIN_SEL,PTD6>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD6>
//     <7=> LCD_P46_fault<selection=LCD_P46_fault_PIN_SEL,PTD6>
//     <1=> Default
#define PTD6_SIG_SEL         1

// Signal mapping for PTD7 pin
//   <o> PTD7 (Alias:D12) [LCD_P47, GPIOD_7, SPI1_MISO, UART0_TX, SPI1_MOSI, LCD_P47_fault]<name=PTD7_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTD7 pin
//     <-2=> LCD_P47 (reset default)<selection=LCD_P47_PIN_SEL,PTD7 (reset default)>
//     <0=> LCD_P47<selection=LCD_P47_PIN_SEL,PTD7>
//     <1=> GPIOD_7<selection=GPIOD_7_PIN_SEL,PTD7>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTD7>
//     <3=> UART0_TX<selection=UART0_TX_PIN_SEL,PTD7>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTD7>
//     <7=> LCD_P47_fault<selection=LCD_P47_fault_PIN_SEL,PTD7>
//     <1=> Default
#define PTD7_SIG_SEL         1

// </h>

// <h> Port E Pins

// Signal mapping for PTE0 pin
//   <o> PTE0 (Alias:D14) [LCD_P48, GPIOE_0, SPI1_MISO, UART1_TX, RTC_CLKOUT, CMP0_OUT, I2C1_SDA, LCD_P48_fault]<name=PTE0_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE0 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P48<selection=LCD_P48_PIN_SEL,PTE0>
//     <1=> GPIOE_0<selection=GPIOE_0_PIN_SEL,PTE0>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTE0>
//     <3=> UART1_TX<selection=UART1_TX_PIN_SEL,PTE0>
//     <4=> RTC_CLKOUT<selection=RTC_CLKOUT_PIN_SEL,PTE0>
//     <5=> CMP0_OUT<selection=CMP0_OUT_PIN_SEL,PTE0>
//     <6=> I2C1_SDA<selection=I2C1_SDA_PIN_SEL,PTE0>
//     <7=> LCD_P48_fault<selection=LCD_P48_fault_PIN_SEL,PTE0>
//     <1=> Default
#define PTE0_SIG_SEL         1

// Signal mapping for PTE1 pin
//   <o> PTE1 (Alias:D15) [LCD_P49, GPIOE_1, SPI1_MOSI, UART1_RX, SPI1_MISO, I2C1_SCL, LCD_P49_fault]<name=PTE1_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE1 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P49<selection=LCD_P49_PIN_SEL,PTE1>
//     <1=> GPIOE_1<selection=GPIOE_1_PIN_SEL,PTE1>
//     <2=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTE1>
//     <3=> UART1_RX<selection=UART1_RX_PIN_SEL,PTE1>
//     <5=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTE1>
//     <6=> I2C1_SCL<selection=I2C1_SCL_PIN_SEL,PTE1>
//     <7=> LCD_P49_fault<selection=LCD_P49_fault_PIN_SEL,PTE1>
//     <1=> Default
#define PTE1_SIG_SEL         1

// Signal mapping for PTE2 pin
//   <o> PTE2 [LCD_P50, GPIOE_2, SPI1_SCK, LCD_P50_fault]<name=PTE2_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE2 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P50<selection=LCD_P50_PIN_SEL,PTE2>
//     <1=> GPIOE_2<selection=GPIOE_2_PIN_SEL,PTE2>
//     <2=> SPI1_SCK<selection=SPI1_SCK_PIN_SEL,PTE2>
//     <7=> LCD_P50_fault<selection=LCD_P50_fault_PIN_SEL,PTE2>
//     <-2=> Default
#define PTE2_SIG_SEL         -2

// Signal mapping for PTE3 pin
//   <o> PTE3 [LCD_P51, GPIOE_3, SPI1_MISO, SPI1_MOSI, LCD_P51_fault]<name=PTE3_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE3 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P51<selection=LCD_P51_PIN_SEL,PTE3>
//     <1=> GPIOE_3<selection=GPIOE_3_PIN_SEL,PTE3>
//     <2=> SPI1_MISO<selection=SPI1_MISO_PIN_SEL,PTE3>
//     <5=> SPI1_MOSI<selection=SPI1_MOSI_PIN_SEL,PTE3>
//     <7=> LCD_P51_fault<selection=LCD_P51_fault_PIN_SEL,PTE3>
//     <-2=> Default
#define PTE3_SIG_SEL         -2

// Signal mapping for PTE4 pin
//   <o> PTE4 [LCD_P52, GPIOE_4, SPI1_PCS0, LCD_P52_fault]<name=PTE4_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE4 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P52<selection=LCD_P52_PIN_SEL,PTE4>
//     <1=> GPIOE_4<selection=GPIOE_4_PIN_SEL,PTE4>
//     <2=> SPI1_PCS0<selection=SPI1_PCS0_PIN_SEL,PTE4>
//     <7=> LCD_P52_fault<selection=LCD_P52_fault_PIN_SEL,PTE4>
//     <-2=> Default
#define PTE4_SIG_SEL         -2

// Signal mapping for PTE5 pin
//   <o> PTE5 [LCD_P53, GPIOE_5, LCD_P53_fault]<name=PTE5_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE5 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P53<selection=LCD_P53_PIN_SEL,PTE5>
//     <1=> GPIOE_5<selection=GPIOE_5_PIN_SEL,PTE5>
//     <7=> LCD_P53_fault<selection=LCD_P53_fault_PIN_SEL,PTE5>
//     <-2=> Default
#define PTE5_SIG_SEL         -2

// Signal mapping for PTE6 pin
//   <o> PTE6 [LCD_P54, GPIOE_6, I2S0_MCLK, USB_SOF_OUT, LCD_P54_fault]<name=PTE6_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE6 pin
//     <-2=> Disabled (reset default)
//     <0=> LCD_P54<selection=LCD_P54_PIN_SEL,PTE6>
//     <1=> GPIOE_6<selection=GPIOE_6_PIN_SEL,PTE6>
//     <4=> I2S0_MCLK<selection=I2S0_MCLK_PIN_SEL,PTE6>
//     <5=> USB_SOF_OUT<selection=USB_SOF_OUT_PIN_SEL,PTE6>
//     <7=> LCD_P54_fault<selection=LCD_P54_fault_PIN_SEL,PTE6>
//     <-2=> Default
#define PTE6_SIG_SEL         -2

// Signal mapping for PTE16 pin
//   <o> PTE16 [LCD_P55/ADC0_DP1/ADC0_SE1, GPIOE_16, SPI0_PCS0, UART2_TX, TPM_CLKIN0, LCD_P55_fault]<name=PTE16_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE16 pin
//     <-2=> LCD_P55/ADC0_DP1/ADC0_SE1 (reset default)<selection=LCD_P55_PIN_SEL,PTE16 (reset default)><selection=ADC0_DP1_PIN_SEL,PTE16 (reset default)><selection=ADC0_SE1_PIN_SEL,PTE16 (reset default)>
//     <0=> LCD_P55/ADC0_DP1/ADC0_SE1<selection=LCD_P55_PIN_SEL,PTE16><selection=ADC0_DP1_PIN_SEL,PTE16><selection=ADC0_SE1_PIN_SEL,PTE16>
//     <1=> GPIOE_16<selection=GPIOE_16_PIN_SEL,PTE16>
//     <2=> SPI0_PCS0<selection=SPI0_PCS0_PIN_SEL,PTE16>
//     <3=> UART2_TX<selection=UART2_TX_PIN_SEL,PTE16>
//     <4=> TPM_CLKIN0<selection=TPM_CLKIN0_PIN_SEL,PTE16>
//     <7=> LCD_P55_fault<selection=LCD_P55_fault_PIN_SEL,PTE16>
//     <-2=> Default
#define PTE16_SIG_SEL        -2

// Signal mapping for PTE17 pin
//   <o> PTE17 [LCD_P56/ADC0_DM1/ADC0_SE5a, GPIOE_17, SPI0_SCK, UART2_RX, TPM_CLKIN1, LPTMR0_ALT3, LCD_P56_fault]<name=PTE17_SIG_SEL>
//   <i> Selects which peripheral signal is mapped to PTE17 pin
//     <-2=> LCD_P56/ADC0_DM1/ADC0_SE5a (reset default)<selection=LCD_P56_PIN_SEL,PTE17 (reset default)><selection=ADC0_DM1_PIN_SEL,PTE17 (reset default)><selection=ADC0_SE5a_PIN_SEL,PTE17 (reset default)>
//     <0=> LCD_P56/ADC0_DM1/ADC0_SE5a<selection=LCD_P56_PIN_SEL,PTE17><selection=ADC0_DM1_PIN_SEL,PTE17><selection=ADC0_SE5a_PIN_SEL,PTE17>
//     <1=> GPIOE_17<selection=GPIOE_17_PIN_SEL,PTE17>
//     <2=> SPI0_SCK<selection=SPI0_SCK_PIN_SEL,PTE17>
//     <3=> UART2_RX<selection=UART2_RX_PIN_SEL,PTE17>
//     <4=> TPM_CLKIN1<selection=TPM_CLKIN1_PIN_SEL,PTE17>
//     <6=> LPTMR0_ALT3<selection=LPTMR0_ALT3_PIN_SEL,PTE17>
//     <7=> LCD_P56_fault<selection=LCD_P56_fault_PIN_SEL,PTE17>
//     <-2=> Default
#define PTE17_SIG_SEL        -2

