podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// </e>

// Pin peripheral signal mapping
//   <e> Mapping by Peripheral Function <name=MAP_BY_FUNCTION><constant>
//   <i> This allows the mapping of peripheral functions to pins
//   <i> to be controlled by peripheral function.
//   <i> This option is active when Mapping by Pin is disabled
//     <0=> Disabled
//     <1=> Enabled
#define MAP_BY_FUNCTION_ENABLED 0

// <h> Analogue to Digital (ADC0)

// Pin Mapping for ADC0_DM0 signal
//   <o> ADC0_DM0 [PTE21]<name=ADC0_DM0_PIN_SEL>
//   <i> Shows which pin ADC0_DM0 is mapped to
//     <0=> Disabled
//     <1=> PTE21 (reset default)<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a (reset default)>
//     <2=> PTE21<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a>
//     <1=> Default
#define ADC0_DM0_PIN_SEL     1
#if ADC0_DM0_PIN_SEL == 2
#define ADC0_DM0_GPIO        digitalIO_PTE21
#define ADC0_DM0_FN          0
#endif

// Pin Mapping for ADC0_DM1 signal
//   <o> ADC0_DM1 [PTE17]<name=ADC0_DM1_PIN_SEL>
//   <i> Shows which pin ADC0_DM1 is mapped to
//     <0=> Disabled
//     <1=> PTE17 (reset default)<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a (reset default)>
//     <2=> PTE17<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a>
//     <1=> Default
#define ADC0_DM1_PIN_SEL     1
#if ADC0_DM1_PIN_SEL == 2
#define ADC0_DM1_GPIO        digitalIO_PTE17
#define ADC0_DM1_FN          0
#endif

// Pin Mapping for ADC0_DM2 signal
//   <o> ADC0_DM2 [PTE19]<name=ADC0_DM2_PIN_SEL>
//   <i> Shows which pin ADC0_DM2 is mapped to
//     <0=> Disabled
//     <1=> PTE19 (reset default)<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a (reset default)>
//     <2=> PTE19<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a>
//     <1=> Default
#define ADC0_DM2_PIN_SEL     1
#if ADC0_DM2_PIN_SEL == 2
#define ADC0_DM2_GPIO        digitalIO_PTE19
#define ADC0_DM2_FN          0
#endif

// Pin Mapping for ADC0_DM3 signal
//   <o> ADC0_DM3 [PTE23]<name=ADC0_DM3_PIN_SEL>
//   <i> Shows which pin ADC0_DM3 is mapped to
//     <0=> Disabled
//     <1=> PTE23 (reset default)<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a (reset default)>
//     <2=> PTE23<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a>
//     <1=> Default
#define ADC0_DM3_PIN_SEL     1
#if ADC0_DM3_PIN_SEL == 2
#define ADC0_DM3_GPIO        digitalIO_PTE23
#define ADC0_DM3_FN          0
#endif

// Pin Mapping for ADC0_DP0 signal
//   <o> ADC0_DP0 [PTE20]<name=ADC0_DP0_PIN_SEL>
//   <i> Shows which pin ADC0_DP0 is mapped to
//     <0=> Disabled
//     <1=> PTE20 (reset default)<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0 (reset default)>
//     <2=> PTE20<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0>
//     <1=> Default
#define ADC0_DP0_PIN_SEL     1
#if ADC0_DP0_PIN_SEL == 2
#define ADC0_DP0_GPIO        digitalIO_PTE20
#define ADC0_DP0_FN          0
#endif

// Pin Mapping for ADC0_DP1 signal
//   <o> ADC0_DP1 [PTE16]<name=ADC0_DP1_PIN_SEL>
//   <i> Shows which pin ADC0_DP1 is mapped to
//     <0=> Disabled
//     <1=> PTE16 (reset default)<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1 (reset default)>
//     <2=> PTE16<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1>
//     <1=> Default
#define ADC0_DP1_PIN_SEL     1
#if ADC0_DP1_PIN_SEL == 2
#define ADC0_DP1_GPIO        digitalIO_PTE16
#define ADC0_DP1_FN          0
#endif

// Pin Mapping for ADC0_DP2 signal
//   <o> ADC0_DP2 [PTE18]<name=ADC0_DP2_PIN_SEL>
//   <i> Shows which pin ADC0_DP2 is mapped to
//     <0=> Disabled
//     <1=> PTE18 (reset default)<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2 (reset default)>
//     <2=> PTE18<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2>
//     <1=> Default
#define ADC0_DP2_PIN_SEL     1
#if ADC0_DP2_PIN_SEL == 2
#define ADC0_DP2_GPIO        digitalIO_PTE18
#define ADC0_DP2_FN          0
#endif

// Pin Mapping for ADC0_DP3 signal
//   <o> ADC0_DP3 [PTE22]<name=ADC0_DP3_PIN_SEL>
//   <i> Shows which pin ADC0_DP3 is mapped to
//     <0=> Disabled
//     <1=> PTE22 (reset default)<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3 (reset default)>
//     <2=> PTE22<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3>
//     <2=> Default
#define ADC0_DP3_PIN_SEL     2
#if ADC0_DP3_PIN_SEL == 2
#define ADC0_DP3_GPIO        digitalIO_PTE22
#define ADC0_DP3_FN          0
#endif

// Pin Mapping for ADC0_SE0 signal
//   <o> ADC0_SE0 [PTE20]<name=ADC0_SE0_PIN_SEL>
//   <i> Shows which pin ADC0_SE0 is mapped to
//     <0=> Disabled
//     <1=> PTE20 (reset default)<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0 (reset default)>
//     <2=> PTE20<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0>
//     <1=> Default
#define ADC0_SE0_PIN_SEL     1
#if ADC0_SE0_PIN_SEL == 2
#define ADC0_SE0_GPIO        digitalIO_PTE20
#define ADC0_SE0_FN          0
#endif

// Pin Mapping for ADC0_SE1 signal
//   <o> ADC0_SE1 [PTE16]<name=ADC0_SE1_PIN_SEL>
//   <i> Shows which pin ADC0_SE1 is mapped to
//     <0=> Disabled
//     <1=> PTE16 (reset default)<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1 (reset default)>
//     <2=> PTE16<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1>
//     <1=> Default
#define ADC0_SE1_PIN_SEL     1
#if ADC0_SE1_PIN_SEL == 2
#define ADC0_SE1_GPIO        digitalIO_PTE16
#define ADC0_SE1_FN          0
#endif

// Pin Mapping for ADC0_SE2 signal
//   <o> ADC0_SE2 [PTE18]<name=ADC0_SE2_PIN_SEL>
//   <i> Shows which pin ADC0_SE2 is mapped to
//     <0=> Disabled
//     <1=> PTE18 (reset default)<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2 (reset default)>
//     <2=> PTE18<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2>
//     <1=> Default
#define ADC0_SE2_PIN_SEL     1
#if ADC0_SE2_PIN_SEL == 2
#define ADC0_SE2_GPIO        digitalIO_PTE18
#define ADC0_SE2_FN          0
#endif

// Pin Mapping for ADC0_SE3 signal
//   <o> ADC0_SE3 [PTE22]<name=ADC0_SE3_PIN_SEL>
//   <i> Shows which pin ADC0_SE3 is mapped to
//     <0=> Disabled
//     <1=> PTE22 (reset default)<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3 (reset default)>
//     <2=> PTE22<selection=PTE22_SIG_SEL,ADC0_DP3/ADC0_SE3>
//     <2=> Default
#define ADC0_SE3_PIN_SEL     2
#if ADC0_SE3_PIN_SEL == 2
#define ADC0_SE3_GPIO        digitalIO_PTE22
#define ADC0_SE3_FN          0
#endif

// Pin Mapping for ADC0_SE4b signal
//   <o> ADC0_SE4b [PTE29]<name=ADC0_SE4b_PIN_SEL>
//   <i> Shows which pin ADC0_SE4b is mapped to
//     <0=> Disabled
//     <1=> PTE29 (reset default)<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b (reset default)>
//     <2=> PTE29<selection=PTE29_SIG_SEL,CMP0_IN5/ADC0_SE4b>
//     <0=> Default
#define ADC0_SE4b_PIN_SEL    0
#if ADC0_SE4b_PIN_SEL == 2
#define ADC0_SE4b_GPIO       digitalIO_PTE29
#define ADC0_SE4b_FN         0
#endif

// Pin Mapping for ADC0_SE4a signal
//   <o> ADC0_SE4a [PTE21]<name=ADC0_SE4a_PIN_SEL>
//   <i> Shows which pin ADC0_SE4a is mapped to
//     <0=> Disabled
//     <1=> PTE21 (reset default)<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a (reset default)>
//     <2=> PTE21<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a>
//     <1=> Default
#define ADC0_SE4a_PIN_SEL    1
#if ADC0_SE4a_PIN_SEL == 2
#define ADC0_SE4a_GPIO       digitalIO_PTE21
#define ADC0_SE4a_FN         0
#endif

// Pin Mapping for ADC0_SE5b signal
//   <o> ADC0_SE5b [PTD1]<name=ADC0_SE5b_PIN_SEL>
//   <i> Shows which pin ADC0_SE5b is mapped to
//     <0=> Disabled
//     <1=> PTD1 (reset default)<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b (reset default)>
//     <2=> PTD1<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b>
//     <0=> Default
#define ADC0_SE5b_PIN_SEL    0
#if ADC0_SE5b_PIN_SEL == 2
#define ADC0_SE5b_GPIO       digitalIO_PTD1
#define ADC0_SE5b_FN         0
#endif

// Pin Mapping for ADC0_SE5a signal
//   <o> ADC0_SE5a [PTE17]<name=ADC0_SE5a_PIN_SEL>
//   <i> Shows which pin ADC0_SE5a is mapped to
//     <0=> Disabled
//     <1=> PTE17 (reset default)<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a (reset default)>
//     <2=> PTE17<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a>
//     <1=> Default
#define ADC0_SE5a_PIN_SEL    1
#if ADC0_SE5a_PIN_SEL == 2
#define ADC0_SE5a_GPIO       digitalIO_PTE17
#define ADC0_SE5a_FN         0
#endif

