podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for ADC0_SE6b signal
//   <o> ADC0_SE6b [PTD5]<name=ADC0_SE6b_PIN_SEL>
//   <i> Shows which pin ADC0_SE6b is mapped to
//     <0=> Disabled
//     <1=> PTD5 (reset default)<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b (reset default)>
//     <2=> PTD5<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b>
//     <0=> Default
#define ADC0_SE6b_PIN_SEL    0
#if ADC0_SE6b_PIN_SEL == 2
#define ADC0_SE6b_GPIO       digitalIO_PTD5
#define ADC0_SE6b_FN         0
#endif

// Pin Mapping for ADC0_SE6a signal
//   <o> ADC0_SE6a [PTE19]<name=ADC0_SE6a_PIN_SEL>
//   <i> Shows which pin ADC0_SE6a is mapped to
//     <0=> Disabled
//     <1=> PTE19 (reset default)<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a (reset default)>
//     <2=> PTE19<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a>
//     <1=> Default
#define ADC0_SE6a_PIN_SEL    1
#if ADC0_SE6a_PIN_SEL == 2
#define ADC0_SE6a_GPIO       digitalIO_PTE19
#define ADC0_SE6a_FN         0
#endif

// Pin Mapping for ADC0_SE7a signal
//   <o> ADC0_SE7a [PTE23]<name=ADC0_SE7a_PIN_SEL>
//   <i> Shows which pin ADC0_SE7a is mapped to
//     <0=> Disabled
//     <1=> PTE23 (reset default)<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a (reset default)>
//     <2=> PTE23<selection=PTE23_SIG_SEL,ADC0_DM3/ADC0_SE7a>
//     <1=> Default
#define ADC0_SE7a_PIN_SEL    1
#if ADC0_SE7a_PIN_SEL == 2
#define ADC0_SE7a_GPIO       digitalIO_PTE23
#define ADC0_SE7a_FN         0
#endif

// Pin Mapping for ADC0_SE7b signal
//   <o> ADC0_SE7b [PTD6]<name=ADC0_SE7b_PIN_SEL>
//   <i> Shows which pin ADC0_SE7b is mapped to
//     <0=> Disabled
//     <1=> PTD6 (reset default)<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b (reset default)>
//     <2=> PTD6<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b>
//     <0=> Default
#define ADC0_SE7b_PIN_SEL    0
#if ADC0_SE7b_PIN_SEL == 2
#define ADC0_SE7b_GPIO       digitalIO_PTD6
#define ADC0_SE7b_FN         0
#endif

// Pin Mapping for ADC0_SE8 signal
//   <o> ADC0_SE8 [PTB0]<name=ADC0_SE8_PIN_SEL>
//   <i> Shows which pin ADC0_SE8 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0>
//     <2=> Default
#define ADC0_SE8_PIN_SEL     2
#if ADC0_SE8_PIN_SEL == 2
#define ADC0_SE8_GPIO        digitalIO_PTB0
#define ADC0_SE8_FN          0
#endif

// Pin Mapping for ADC0_SE9 signal
//   <o> ADC0_SE9 [PTB1]<name=ADC0_SE9_PIN_SEL>
//   <i> Shows which pin ADC0_SE9 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6>
//     <2=> Default
#define ADC0_SE9_PIN_SEL     2
#if ADC0_SE9_PIN_SEL == 2
#define ADC0_SE9_GPIO        digitalIO_PTB1
#define ADC0_SE9_FN          0
#endif

// Pin Mapping for ADC0_SE11 signal
//   <o> ADC0_SE11 [PTC2]<name=ADC0_SE11_PIN_SEL>
//   <i> Shows which pin ADC0_SE11 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (reset default)<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15 (reset default)>
//     <2=> PTC2<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15>
//     <2=> Default
#define ADC0_SE11_PIN_SEL    2
#if ADC0_SE11_PIN_SEL == 2
#define ADC0_SE11_GPIO       digitalIO_PTC2
#define ADC0_SE11_FN         0
#endif

// Pin Mapping for ADC0_SE12 signal
//   <o> ADC0_SE12 [PTB2]<name=ADC0_SE12_PIN_SEL>
//   <i> Shows which pin ADC0_SE12 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (reset default)<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7 (reset default)>
//     <2=> PTB2<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7>
//     <2=> Default
#define ADC0_SE12_PIN_SEL    2
#if ADC0_SE12_PIN_SEL == 2
#define ADC0_SE12_GPIO       digitalIO_PTB2
#define ADC0_SE12_FN         0
#endif

// Pin Mapping for ADC0_SE13 signal
//   <o> ADC0_SE13 [PTB3]<name=ADC0_SE13_PIN_SEL>
//   <i> Shows which pin ADC0_SE13 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (reset default)<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8 (reset default)>
//     <2=> PTB3<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8>
//     <2=> Default
#define ADC0_SE13_PIN_SEL    2
#if ADC0_SE13_PIN_SEL == 2
#define ADC0_SE13_GPIO       digitalIO_PTB3
#define ADC0_SE13_FN         0
#endif

// Pin Mapping for ADC0_SE14 signal
//   <o> ADC0_SE14 [PTC0]<name=ADC0_SE14_PIN_SEL>
//   <i> Shows which pin ADC0_SE14 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13>
//     <1=> Default
#define ADC0_SE14_PIN_SEL    1
#if ADC0_SE14_PIN_SEL == 2
#define ADC0_SE14_GPIO       digitalIO_PTC0
#define ADC0_SE14_FN         0
#endif

// Pin Mapping for ADC0_SE15 signal
//   <o> ADC0_SE15 [PTC1]<name=ADC0_SE15_PIN_SEL>
//   <i> Shows which pin ADC0_SE15 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (reset default)<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14 (reset default)>
//     <2=> PTC1<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14>
//     <2=> Default
#define ADC0_SE15_PIN_SEL    2
#if ADC0_SE15_PIN_SEL == 2
#define ADC0_SE15_GPIO       digitalIO_PTC1
#define ADC0_SE15_FN         0
#endif

// Pin Mapping for ADC0_SE23 signal
//   <o> ADC0_SE23 [PTE30]<name=ADC0_SE23_PIN_SEL>
//   <i> Shows which pin ADC0_SE23 is mapped to
//     <0=> Disabled
//     <1=> PTE30 (reset default)<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4 (reset default)>
//     <2=> PTE30<selection=PTE30_SIG_SEL,DAC0_OUT/ADC0_SE23/CMP0_IN4>
//     <1=> Default
#define ADC0_SE23_PIN_SEL    1
#if ADC0_SE23_PIN_SEL == 2
#define ADC0_SE23_GPIO       digitalIO_PTE30
#define ADC0_SE23_FN         0
#endif

// </h>

// <h> Clock and Timing

// Pin Mapping for CLKOUT signal
//   <o> CLKOUT [PTC3]<name=CLKOUT_PIN_SEL>
//   <i> Shows which pin CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,CLKOUT>
//     <0=> Default
#define CLKOUT_PIN_SEL       0
#if CLKOUT_PIN_SEL == 1
#define CLKOUT_GPIO          digitalIO_PTC3
#define CLKOUT_FN            5
#endif

// Pin Mapping for EXTAL0 signal
//   <o> EXTAL0 [PTA18]<name=EXTAL0_PIN_SEL>
//   <i> Shows which pin EXTAL0 is mapped to
//     <0=> Disabled
//     <1=> PTA18 (reset default)<selection=PTA18_SIG_SEL,EXTAL0 (reset default)>
//     <2=> PTA18<selection=PTA18_SIG_SEL,EXTAL0>
//     <1=> Default
#define EXTAL0_PIN_SEL       1
#if EXTAL0_PIN_SEL == 2
#define EXTAL0_GPIO          digitalIO_PTA18
#define EXTAL0_FN            0
#endif

// Pin Mapping for EXTRG_IN signal
//   <o> EXTRG_IN [PTB8, PTC0, PTC6]<name=EXTRG_IN_PIN_SEL>
//   <i> Shows which pin EXTRG_IN is mapped to
//     <0=> Disabled
//     <1=> PTB8<selection=PTB8_SIG_SEL,EXTRG_IN>
//     <2=> PTC0<selection=PTC0_SIG_SEL,EXTRG_IN>
//     <3=> PTC6<selection=PTC6_SIG_SEL,EXTRG_IN>
//     <0=> Default
#define EXTRG_IN_PIN_SEL     0
#if EXTRG_IN_PIN_SEL == 1
#define EXTRG_IN_GPIO        digitalIO_PTB8
#define EXTRG_IN_FN          3
#elif EXTRG_IN_PIN_SEL == 2
#define EXTRG_IN_GPIO        digitalIO_PTC0
#define EXTRG_IN_FN          3
#elif EXTRG_IN_PIN_SEL == 3
#define EXTRG_IN_GPIO        digitalIO_PTC6
#define EXTRG_IN_FN          3
#endif

// Pin Mapping for RTC_CLKIN signal
//   <o> RTC_CLKIN [PTC1]<name=RTC_CLKIN_PIN_SEL>
//   <i> Shows which pin RTC_CLKIN is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,GPIOC_1/LLWU_P6/RTC_CLKIN>
//     <0=> Default
#define RTC_CLKIN_PIN_SEL    0
#if RTC_CLKIN_PIN_SEL == 1
#define RTC_CLKIN_GPIO       digitalIO_PTC1
#define RTC_CLKIN_FN         1
#endif

// Pin Mapping for RTC_CLKOUT signal
//   <o> RTC_CLKOUT [PTE0, PTE26]<name=RTC_CLKOUT_PIN_SEL>
//   <i> Shows which pin RTC_CLKOUT is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,RTC_CLKOUT>
//     <2=> PTE26<selection=PTE26_SIG_SEL,RTC_CLKOUT>
//     <0=> Default
#define RTC_CLKOUT_PIN_SEL   0
#if RTC_CLKOUT_PIN_SEL == 1
#define RTC_CLKOUT_GPIO      digitalIO_PTE0
#define RTC_CLKOUT_FN        4
#elif RTC_CLKOUT_PIN_SEL == 2
#define RTC_CLKOUT_GPIO      digitalIO_PTE26
#define RTC_CLKOUT_FN        6
#endif

// Pin Mapping for TPM_CLKIN0 signal
//   <o> TPM_CLKIN0 [PTA18, PTB16, PTC12, PTE16, PTE29]<name=TPM_CLKIN0_PIN_SEL>
//   <i> Shows which pin TPM_CLKIN0 is mapped to
//     <0=> Disabled
//     <1=> PTA18<selection=PTA18_SIG_SEL,TPM_CLKIN0>
//     <2=> PTB16<selection=PTB16_SIG_SEL,TPM_CLKIN0>
//     <3=> PTC12<selection=PTC12_SIG_SEL,TPM_CLKIN0>
//     <4=> PTE16<selection=PTE16_SIG_SEL,TPM_CLKIN0>
//     <5=> PTE29<selection=PTE29_SIG_SEL,TPM_CLKIN0>
//     <0=> Default
#define TPM_CLKIN0_PIN_SEL   0
#if TPM_CLKIN0_PIN_SEL == 1
#define TPM_CLKIN0_GPIO      digitalIO_PTA18
#define TPM_CLKIN0_FN        4
#elif TPM_CLKIN0_PIN_SEL == 2
#define TPM_CLKIN0_GPIO      digitalIO_PTB16
#define TPM_CLKIN0_FN        4
#elif TPM_CLKIN0_PIN_SEL == 3
#define TPM_CLKIN0_GPIO      digitalIO_PTC12
#define TPM_CLKIN0_FN        4
#elif TPM_CLKIN0_PIN_SEL == 4
#define TPM_CLKIN0_GPIO      digitalIO_PTE16
#define TPM_CLKIN0_FN        4
#elif TPM_CLKIN0_PIN_SEL == 5
#define TPM_CLKIN0_GPIO      digitalIO_PTE29
#define TPM_CLKIN0_FN        4
#endif

