podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for GPIOE_23 signal
//   <o> GPIOE_23 [PTE23]<name=GPIOE_23_PIN_SEL>
//   <i> Shows which pin GPIOE_23 is mapped to
//     <0=> Disabled
//     <1=> PTE23<selection=PTE23_SIG_SEL,GPIOE_23>
//     <0=> Default
#define GPIOE_23_PIN_SEL     0
#if GPIOE_23_PIN_SEL == 1
#define GPIOE_23_GPIO        digitalIO_PTE23
#define GPIOE_23_FN          1
#endif

// Pin Mapping for GPIOE_24 signal
//   <o> GPIOE_24 [PTE24]<name=GPIOE_24_PIN_SEL>
//   <i> Shows which pin GPIOE_24 is mapped to
//     <0=> Disabled
//     <1=> PTE24<selection=PTE24_SIG_SEL,GPIOE_24>
//     <0=> Default
#define GPIOE_24_PIN_SEL     0
#if GPIOE_24_PIN_SEL == 1
#define GPIOE_24_GPIO        digitalIO_PTE24
#define GPIOE_24_FN          1
#endif

// Pin Mapping for GPIOE_25 signal
//   <o> GPIOE_25 [PTE25]<name=GPIOE_25_PIN_SEL>
//   <i> Shows which pin GPIOE_25 is mapped to
//     <0=> Disabled
//     <1=> PTE25<selection=PTE25_SIG_SEL,GPIOE_25>
//     <0=> Default
#define GPIOE_25_PIN_SEL     0
#if GPIOE_25_PIN_SEL == 1
#define GPIOE_25_GPIO        digitalIO_PTE25
#define GPIOE_25_FN          1
#endif

// Pin Mapping for GPIOE_26 signal
//   <o> GPIOE_26 [PTE26]<name=GPIOE_26_PIN_SEL>
//   <i> Shows which pin GPIOE_26 is mapped to
//     <0=> Disabled
//     <1=> PTE26<selection=PTE26_SIG_SEL,GPIOE_26>
//     <0=> Default
#define GPIOE_26_PIN_SEL     0
#if GPIOE_26_PIN_SEL == 1
#define GPIOE_26_GPIO        digitalIO_PTE26
#define GPIOE_26_FN          1
#endif

// Pin Mapping for GPIOE_29 signal
//   <o> GPIOE_29 [PTE29]<name=GPIOE_29_PIN_SEL>
//   <i> Shows which pin GPIOE_29 is mapped to
//     <0=> Disabled
//     <1=> PTE29<selection=PTE29_SIG_SEL,GPIOE_29>
//     <0=> Default
#define GPIOE_29_PIN_SEL     0
#if GPIOE_29_PIN_SEL == 1
#define GPIOE_29_GPIO        digitalIO_PTE29
#define GPIOE_29_FN          1
#endif

// Pin Mapping for GPIOE_30 signal
//   <o> GPIOE_30 [PTE30]<name=GPIOE_30_PIN_SEL>
//   <i> Shows which pin GPIOE_30 is mapped to
//     <0=> Disabled
//     <1=> PTE30<selection=PTE30_SIG_SEL,GPIOE_30>
//     <0=> Default
#define GPIOE_30_PIN_SEL     0
#if GPIOE_30_PIN_SEL == 1
#define GPIOE_30_GPIO        digitalIO_PTE30
#define GPIOE_30_FN          1
#endif

// Pin Mapping for GPIOE_31 signal
//   <o> GPIOE_31 [PTE31]<name=GPIOE_31_PIN_SEL>
//   <i> Shows which pin GPIOE_31 is mapped to
//     <0=> Disabled
//     <1=> PTE31<selection=PTE31_SIG_SEL,GPIOE_31>
//     <0=> Default
#define GPIOE_31_PIN_SEL     0
#if GPIOE_31_PIN_SEL == 1
#define GPIOE_31_GPIO        digitalIO_PTE31
#define GPIOE_31_FN          1
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C0)

// Pin Mapping for I2C0_SCL signal
//   <o> I2C0_SCL [PTB0, PTB2, PTC8, PTE19, PTE24]<name=I2C0_SCL_PIN_SEL>
//   <i> Shows which pin I2C0_SCL is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,I2C0_SCL>
//     <2=> PTB2<selection=PTB2_SIG_SEL,I2C0_SCL>
//     <3=> PTC8<selection=PTC8_SIG_SEL,I2C0_SCL>
//     <4=> PTE19<selection=PTE19_SIG_SEL,I2C0_SCL>
//     <5=> PTE24<selection=PTE24_SIG_SEL,I2C0_SCL>
//     <5=> Default
#define I2C0_SCL_PIN_SEL     5
#if I2C0_SCL_PIN_SEL == 1
#define I2C0_SCL_GPIO        digitalIO_PTB0
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 2
#define I2C0_SCL_GPIO        digitalIO_PTB2
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 3
#define I2C0_SCL_GPIO        digitalIO_PTC8
#define I2C0_SCL_FN          2
#elif I2C0_SCL_PIN_SEL == 4
#define I2C0_SCL_GPIO        digitalIO_PTE19
#define I2C0_SCL_FN          4
#elif I2C0_SCL_PIN_SEL == 5
#define I2C0_SCL_GPIO        digitalIO_PTE24
#define I2C0_SCL_FN          5
#endif

// Pin Mapping for I2C0_SDA signal
//   <o> I2C0_SDA [PTB1, PTB3, PTC9, PTE18, PTE25]<name=I2C0_SDA_PIN_SEL>
//   <i> Shows which pin I2C0_SDA is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,I2C0_SDA>
//     <2=> PTB3<selection=PTB3_SIG_SEL,I2C0_SDA>
//     <3=> PTC9<selection=PTC9_SIG_SEL,I2C0_SDA>
//     <4=> PTE18<selection=PTE18_SIG_SEL,I2C0_SDA>
//     <5=> PTE25<selection=PTE25_SIG_SEL,I2C0_SDA>
//     <5=> Default
#define I2C0_SDA_PIN_SEL     5
#if I2C0_SDA_PIN_SEL == 1
#define I2C0_SDA_GPIO        digitalIO_PTB1
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 2
#define I2C0_SDA_GPIO        digitalIO_PTB3
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 3
#define I2C0_SDA_GPIO        digitalIO_PTC9
#define I2C0_SDA_FN          2
#elif I2C0_SDA_PIN_SEL == 4
#define I2C0_SDA_GPIO        digitalIO_PTE18
#define I2C0_SDA_FN          4
#elif I2C0_SDA_PIN_SEL == 5
#define I2C0_SDA_GPIO        digitalIO_PTE25
#define I2C0_SDA_FN          5
#endif

// </h>

// <h> Inter-Integrated Circuit (I2C1)

// Pin Mapping for I2C1_SDA signal
//   <o> I2C1_SDA [PTA4, PTC2, PTC11, PTE0]<name=I2C1_SDA_PIN_SEL>
//   <i> Shows which pin I2C1_SDA is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,I2C1_SDA>
//     <2=> PTC2<selection=PTC2_SIG_SEL,I2C1_SDA>
//     <3=> PTC11<selection=PTC11_SIG_SEL,I2C1_SDA>
//     <4=> PTE0<selection=PTE0_SIG_SEL,I2C1_SDA>
//     <0=> Default
#define I2C1_SDA_PIN_SEL     0
#if I2C1_SDA_PIN_SEL == 1
#define I2C1_SDA_GPIO        digitalIO_PTA4
#define I2C1_SDA_FN          2
#elif I2C1_SDA_PIN_SEL == 2
#define I2C1_SDA_GPIO        digitalIO_PTC2
#define I2C1_SDA_FN          2
#elif I2C1_SDA_PIN_SEL == 3
#define I2C1_SDA_GPIO        digitalIO_PTC11
#define I2C1_SDA_FN          2
#elif I2C1_SDA_PIN_SEL == 4
#define I2C1_SDA_GPIO        digitalIO_PTE0
#define I2C1_SDA_FN          6
#endif

// Pin Mapping for I2C1_SCL signal
//   <o> I2C1_SCL [PTA3, PTC1, PTC10, PTE1]<name=I2C1_SCL_PIN_SEL>
//   <i> Shows which pin I2C1_SCL is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,I2C1_SCL>
//     <2=> PTC1<selection=PTC1_SIG_SEL,I2C1_SCL>
//     <3=> PTC10<selection=PTC10_SIG_SEL,I2C1_SCL>
//     <4=> PTE1<selection=PTE1_SIG_SEL,I2C1_SCL>
//     <0=> Default
#define I2C1_SCL_PIN_SEL     0
#if I2C1_SCL_PIN_SEL == 1
#define I2C1_SCL_GPIO        digitalIO_PTA3
#define I2C1_SCL_FN          2
#elif I2C1_SCL_PIN_SEL == 2
#define I2C1_SCL_GPIO        digitalIO_PTC1
#define I2C1_SCL_FN          2
#elif I2C1_SCL_PIN_SEL == 3
#define I2C1_SCL_GPIO        digitalIO_PTC10
#define I2C1_SCL_FN          2
#elif I2C1_SCL_PIN_SEL == 4
#define I2C1_SCL_GPIO        digitalIO_PTE1
#define I2C1_SCL_FN          6
#endif

