podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// <h> Integrated Interchip Sound (I2S0)

// Pin Mapping for I2S0_MCLK signal
//   <o> I2S0_MCLK [PTC8, PTE6, PTC4, PTA17, PTC6]<name=I2S0_MCLK_PIN_SEL>
//   <i> Shows which pin I2S0_MCLK is mapped to
//     <0=> Disabled
//     <1=> PTC8<selection=PTC8_SIG_SEL,I2S0_MCLK>
//     <2=> PTE6<selection=PTE6_SIG_SEL,I2S0_MCLK>
//     <3=> PTC4<selection=PTC4_SIG_SEL,I2S0_MCLK>
//     <4=> PTA17<selection=PTA17_SIG_SEL,I2S0_MCLK>
//     <5=> PTC6<selection=PTC6_SIG_SEL,I2S0_MCLK>
//     <0=> Default
#define I2S0_MCLK_PIN_SEL    0
#if I2S0_MCLK_PIN_SEL == 1
#define I2S0_MCLK_GPIO       digitalIO_PTC8
#define I2S0_MCLK_FN         4
#elif I2S0_MCLK_PIN_SEL == 2
#define I2S0_MCLK_GPIO       digitalIO_PTE6
#define I2S0_MCLK_FN         4
#elif I2S0_MCLK_PIN_SEL == 3
#define I2S0_MCLK_GPIO       digitalIO_PTC4
#define I2S0_MCLK_FN         5
#elif I2S0_MCLK_PIN_SEL == 4
#define I2S0_MCLK_GPIO       digitalIO_PTA17
#define I2S0_MCLK_FN         6
#elif I2S0_MCLK_PIN_SEL == 5
#define I2S0_MCLK_GPIO       digitalIO_PTC6
#define I2S0_MCLK_FN         6
#endif

// Pin Mapping for I2S0_RX_FS signal
//   <o> I2S0_RX_FS [PTC7, PTC10, PTA16]<name=I2S0_RX_FS_PIN_SEL>
//   <i> Shows which pin I2S0_RX_FS is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,I2S0_RX_FS>
//     <2=> PTC10<selection=PTC10_SIG_SEL,I2S0_RX_FS>
//     <3=> PTA16<selection=PTA16_SIG_SEL,I2S0_RX_FS>
//     <0=> Default
#define I2S0_RX_FS_PIN_SEL   0
#if I2S0_RX_FS_PIN_SEL == 1
#define I2S0_RX_FS_GPIO      digitalIO_PTC7
#define I2S0_RX_FS_FN        4
#elif I2S0_RX_FS_PIN_SEL == 2
#define I2S0_RX_FS_GPIO      digitalIO_PTC10
#define I2S0_RX_FS_FN        4
#elif I2S0_RX_FS_PIN_SEL == 3
#define I2S0_RX_FS_GPIO      digitalIO_PTA16
#define I2S0_RX_FS_FN        6
#endif

// Pin Mapping for I2S0_TX_BCLK signal
//   <o> I2S0_TX_BCLK [PTB18, PTA5, PTC3]<name=I2S0_TX_BCLK_PIN_SEL>
//   <i> Shows which pin I2S0_TX_BCLK is mapped to
//     <0=> Disabled
//     <1=> PTB18<selection=PTB18_SIG_SEL,I2S0_TX_BCLK>
//     <2=> PTA5<selection=PTA5_SIG_SEL,I2S0_TX_BCLK>
//     <3=> PTC3<selection=PTC3_SIG_SEL,I2S0_TX_BCLK>
//     <0=> Default
#define I2S0_TX_BCLK_PIN_SEL 0
#if I2S0_TX_BCLK_PIN_SEL == 1
#define I2S0_TX_BCLK_GPIO    digitalIO_PTB18
#define I2S0_TX_BCLK_FN      4
#elif I2S0_TX_BCLK_PIN_SEL == 2
#define I2S0_TX_BCLK_GPIO    digitalIO_PTA5
#define I2S0_TX_BCLK_FN      6
#elif I2S0_TX_BCLK_PIN_SEL == 3
#define I2S0_TX_BCLK_GPIO    digitalIO_PTC3
#define I2S0_TX_BCLK_FN      6
#endif

// Pin Mapping for I2S0_TXD0 signal
//   <o> I2S0_TXD0 [PTA12, PTC0, PTC1, PTA14]<name=I2S0_TXD0_PIN_SEL>
//   <i> Shows which pin I2S0_TXD0 is mapped to
//     <0=> Disabled
//     <1=> PTA12<selection=PTA12_SIG_SEL,I2S0_TXD0>
//     <2=> PTC0<selection=PTC0_SIG_SEL,I2S0_TXD0>
//     <3=> PTC1<selection=PTC1_SIG_SEL,I2S0_TXD0>
//     <4=> PTA14<selection=PTA14_SIG_SEL,I2S0_TXD0>
//     <0=> Default
#define I2S0_TXD0_PIN_SEL    0
#if I2S0_TXD0_PIN_SEL == 1
#define I2S0_TXD0_GPIO       digitalIO_PTA12
#define I2S0_TXD0_FN         6
#elif I2S0_TXD0_PIN_SEL == 2
#define I2S0_TXD0_GPIO       digitalIO_PTC0
#define I2S0_TXD0_FN         6
#elif I2S0_TXD0_PIN_SEL == 3
#define I2S0_TXD0_GPIO       digitalIO_PTC1
#define I2S0_TXD0_FN         6
#elif I2S0_TXD0_PIN_SEL == 4
#define I2S0_TXD0_GPIO       digitalIO_PTA14
#define I2S0_TXD0_FN         7
#endif

// Pin Mapping for I2S0_RX_BCLK signal
//   <o> I2S0_RX_BCLK [PTC6, PTC9, PTA14]<name=I2S0_RX_BCLK_PIN_SEL>
//   <i> Shows which pin I2S0_RX_BCLK is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,I2S0_RX_BCLK>
//     <2=> PTC9<selection=PTC9_SIG_SEL,I2S0_RX_BCLK>
//     <3=> PTA14<selection=PTA14_SIG_SEL,I2S0_RX_BCLK>
//     <0=> Default
#define I2S0_RX_BCLK_PIN_SEL 0
#if I2S0_RX_BCLK_PIN_SEL == 1
#define I2S0_RX_BCLK_GPIO    digitalIO_PTC6
#define I2S0_RX_BCLK_FN      4
#elif I2S0_RX_BCLK_PIN_SEL == 2
#define I2S0_RX_BCLK_GPIO    digitalIO_PTC9
#define I2S0_RX_BCLK_FN      4
#elif I2S0_RX_BCLK_PIN_SEL == 3
#define I2S0_RX_BCLK_GPIO    digitalIO_PTA14
#define I2S0_RX_BCLK_FN      6
#endif

// Pin Mapping for I2S0_TX_FS signal
//   <o> I2S0_TX_FS [PTB19, PTA13, PTC2]<name=I2S0_TX_FS_PIN_SEL>
//   <i> Shows which pin I2S0_TX_FS is mapped to
//     <0=> Disabled
//     <1=> PTB19<selection=PTB19_SIG_SEL,I2S0_TX_FS>
//     <2=> PTA13<selection=PTA13_SIG_SEL,I2S0_TX_FS>
//     <3=> PTC2<selection=PTC2_SIG_SEL,I2S0_TX_FS>
//     <0=> Default
#define I2S0_TX_FS_PIN_SEL   0
#if I2S0_TX_FS_PIN_SEL == 1
#define I2S0_TX_FS_GPIO      digitalIO_PTB19
#define I2S0_TX_FS_FN        4
#elif I2S0_TX_FS_PIN_SEL == 2
#define I2S0_TX_FS_GPIO      digitalIO_PTA13
#define I2S0_TX_FS_FN        6
#elif I2S0_TX_FS_PIN_SEL == 3
#define I2S0_TX_FS_GPIO      digitalIO_PTC2
#define I2S0_TX_FS_FN        6
#endif

// Pin Mapping for I2S0_RXD0 signal
//   <o> I2S0_RXD0 [PTC5, PTC11, PTA15, PTA16]<name=I2S0_RXD0_PIN_SEL>
//   <i> Shows which pin I2S0_RXD0 is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,I2S0_RXD0>
//     <2=> PTC11<selection=PTC11_SIG_SEL,I2S0_RXD0>
//     <3=> PTA15<selection=PTA15_SIG_SEL,I2S0_RXD0>
//     <4=> PTA16<selection=PTA16_SIG_SEL,I2S0_RXD0>
//     <0=> Default
#define I2S0_RXD0_PIN_SEL    0
#if I2S0_RXD0_PIN_SEL == 1
#define I2S0_RXD0_GPIO       digitalIO_PTC5
#define I2S0_RXD0_FN         4
#elif I2S0_RXD0_PIN_SEL == 2
#define I2S0_RXD0_GPIO       digitalIO_PTC11
#define I2S0_RXD0_FN         4
#elif I2S0_RXD0_PIN_SEL == 3
#define I2S0_RXD0_GPIO       digitalIO_PTA15
#define I2S0_RXD0_FN         6
#elif I2S0_RXD0_PIN_SEL == 4
#define I2S0_RXD0_GPIO       digitalIO_PTA16
#define I2S0_RXD0_FN         7
#endif

// </h>

// <h> Liquid Crystal Display

// Pin Mapping for LCD_P0 signal
//   <o> LCD_P0 [PTB0]<name=LCD_P0_PIN_SEL>
//   <i> Shows which pin LCD_P0 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0>
//     <2=> Default
#define LCD_P0_PIN_SEL       2
#if LCD_P0_PIN_SEL == 2
#define LCD_P0_GPIO          digitalIO_PTB0
#define LCD_P0_FN            0
#endif

// Pin Mapping for LCD_P0_fault signal
//   <o> LCD_P0_fault [PTB0]<name=LCD_P0_fault_PIN_SEL>
//   <i> Shows which pin LCD_P0_fault is mapped to
//     <0=> Disabled
//     <1=> PTB0<selection=PTB0_SIG_SEL,LCD_P0_fault>
//     <0=> Default
#define LCD_P0_fault_PIN_SEL 0
#if LCD_P0_fault_PIN_SEL == 1
#define LCD_P0_fault_GPIO    digitalIO_PTB0
#define LCD_P0_fault_FN      7
#endif

// Pin Mapping for LCD_P1 signal
//   <o> LCD_P1 [PTB1]<name=LCD_P1_PIN_SEL>
//   <i> Shows which pin LCD_P1 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6>
//     <2=> Default
#define LCD_P1_PIN_SEL       2
#if LCD_P1_PIN_SEL == 2
#define LCD_P1_GPIO          digitalIO_PTB1
#define LCD_P1_FN            0
#endif

// Pin Mapping for LCD_P1_fault signal
//   <o> LCD_P1_fault [PTB1]<name=LCD_P1_fault_PIN_SEL>
//   <i> Shows which pin LCD_P1_fault is mapped to
//     <0=> Disabled
//     <1=> PTB1<selection=PTB1_SIG_SEL,LCD_P1_fault>
//     <0=> Default
#define LCD_P1_fault_PIN_SEL 0
#if LCD_P1_fault_PIN_SEL == 1
#define LCD_P1_fault_GPIO    digitalIO_PTB1
#define LCD_P1_fault_FN      7
#endif

