podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P2 signal
//   <o> LCD_P2 [PTB2]<name=LCD_P2_PIN_SEL>
//   <i> Shows which pin LCD_P2 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (reset default)<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7 (reset default)>
//     <2=> PTB2<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7>
//     <2=> Default
#define LCD_P2_PIN_SEL       2
#if LCD_P2_PIN_SEL == 2
#define LCD_P2_GPIO          digitalIO_PTB2
#define LCD_P2_FN            0
#endif

// Pin Mapping for LCD_P2_fault signal
//   <o> LCD_P2_fault [PTB2]<name=LCD_P2_fault_PIN_SEL>
//   <i> Shows which pin LCD_P2_fault is mapped to
//     <0=> Disabled
//     <1=> PTB2<selection=PTB2_SIG_SEL,LCD_P2_fault>
//     <0=> Default
#define LCD_P2_fault_PIN_SEL 0
#if LCD_P2_fault_PIN_SEL == 1
#define LCD_P2_fault_GPIO    digitalIO_PTB2
#define LCD_P2_fault_FN      7
#endif

// Pin Mapping for LCD_P3 signal
//   <o> LCD_P3 [PTB3]<name=LCD_P3_PIN_SEL>
//   <i> Shows which pin LCD_P3 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (reset default)<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8 (reset default)>
//     <2=> PTB3<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8>
//     <2=> Default
#define LCD_P3_PIN_SEL       2
#if LCD_P3_PIN_SEL == 2
#define LCD_P3_GPIO          digitalIO_PTB3
#define LCD_P3_FN            0
#endif

// Pin Mapping for LCD_P3_fault signal
//   <o> LCD_P3_fault [PTB3]<name=LCD_P3_fault_PIN_SEL>
//   <i> Shows which pin LCD_P3_fault is mapped to
//     <0=> Disabled
//     <1=> PTB3<selection=PTB3_SIG_SEL,LCD_P3_fault>
//     <0=> Default
#define LCD_P3_fault_PIN_SEL 0
#if LCD_P3_fault_PIN_SEL == 1
#define LCD_P3_fault_GPIO    digitalIO_PTB3
#define LCD_P3_fault_FN      7
#endif

// Pin Mapping for LCD_P7 signal
//   <o> LCD_P7 [PTB7]<name=LCD_P7_PIN_SEL>
//   <i> Shows which pin LCD_P7 is mapped to
//     <0=> Disabled
//     <1=> PTB7 (reset default)<selection=PTB7_SIG_SEL,LCD_P7 (reset default)>
//     <2=> PTB7<selection=PTB7_SIG_SEL,LCD_P7>
//     <1=> Default
#define LCD_P7_PIN_SEL       1
#if LCD_P7_PIN_SEL == 2
#define LCD_P7_GPIO          digitalIO_PTB7
#define LCD_P7_FN            0
#endif

// Pin Mapping for LCD_P7_fault signal
//   <o> LCD_P7_fault [PTB7]<name=LCD_P7_fault_PIN_SEL>
//   <i> Shows which pin LCD_P7_fault is mapped to
//     <0=> Disabled
//     <1=> PTB7<selection=PTB7_SIG_SEL,LCD_P7_fault>
//     <0=> Default
#define LCD_P7_fault_PIN_SEL 0
#if LCD_P7_fault_PIN_SEL == 1
#define LCD_P7_fault_GPIO    digitalIO_PTB7
#define LCD_P7_fault_FN      7
#endif

// Pin Mapping for LCD_P8 signal
//   <o> LCD_P8 [PTB8]<name=LCD_P8_PIN_SEL>
//   <i> Shows which pin LCD_P8 is mapped to
//     <0=> Disabled
//     <1=> PTB8 (reset default)<selection=PTB8_SIG_SEL,LCD_P8 (reset default)>
//     <2=> PTB8<selection=PTB8_SIG_SEL,LCD_P8>
//     <1=> Default
#define LCD_P8_PIN_SEL       1
#if LCD_P8_PIN_SEL == 2
#define LCD_P8_GPIO          digitalIO_PTB8
#define LCD_P8_FN            0
#endif

// Pin Mapping for LCD_P8_fault signal
//   <o> LCD_P8_fault [PTB8]<name=LCD_P8_fault_PIN_SEL>
//   <i> Shows which pin LCD_P8_fault is mapped to
//     <0=> Disabled
//     <1=> PTB8<selection=PTB8_SIG_SEL,LCD_P8_fault>
//     <0=> Default
#define LCD_P8_fault_PIN_SEL 0
#if LCD_P8_fault_PIN_SEL == 1
#define LCD_P8_fault_GPIO    digitalIO_PTB8
#define LCD_P8_fault_FN      7
#endif

// Pin Mapping for LCD_P9 signal
//   <o> LCD_P9 [PTB9]<name=LCD_P9_PIN_SEL>
//   <i> Shows which pin LCD_P9 is mapped to
//     <0=> Disabled
//     <1=> PTB9 (reset default)<selection=PTB9_SIG_SEL,LCD_P9 (reset default)>
//     <2=> PTB9<selection=PTB9_SIG_SEL,LCD_P9>
//     <1=> Default
#define LCD_P9_PIN_SEL       1
#if LCD_P9_PIN_SEL == 2
#define LCD_P9_GPIO          digitalIO_PTB9
#define LCD_P9_FN            0
#endif

// Pin Mapping for LCD_P9_fault signal
//   <o> LCD_P9_fault [PTB9]<name=LCD_P9_fault_PIN_SEL>
//   <i> Shows which pin LCD_P9_fault is mapped to
//     <0=> Disabled
//     <1=> PTB9<selection=PTB9_SIG_SEL,LCD_P9_fault>
//     <0=> Default
#define LCD_P9_fault_PIN_SEL 0
#if LCD_P9_fault_PIN_SEL == 1
#define LCD_P9_fault_GPIO    digitalIO_PTB9
#define LCD_P9_fault_FN      7
#endif

// Pin Mapping for LCD_P10 signal
//   <o> LCD_P10 [PTB10]<name=LCD_P10_PIN_SEL>
//   <i> Shows which pin LCD_P10 is mapped to
//     <0=> Disabled
//     <1=> PTB10 (reset default)<selection=PTB10_SIG_SEL,LCD_P10 (reset default)>
//     <2=> PTB10<selection=PTB10_SIG_SEL,LCD_P10>
//     <1=> Default
#define LCD_P10_PIN_SEL      1
#if LCD_P10_PIN_SEL == 2
#define LCD_P10_GPIO         digitalIO_PTB10
#define LCD_P10_FN           0
#endif

// Pin Mapping for LCD_P10_fault signal
//   <o> LCD_P10_fault [PTB10]<name=LCD_P10_fault_PIN_SEL>
//   <i> Shows which pin LCD_P10_fault is mapped to
//     <0=> Disabled
//     <1=> PTB10<selection=PTB10_SIG_SEL,LCD_P10_fault>
//     <0=> Default
#define LCD_P10_fault_PIN_SEL 0
#if LCD_P10_fault_PIN_SEL == 1
#define LCD_P10_fault_GPIO   digitalIO_PTB10
#define LCD_P10_fault_FN     7
#endif

// Pin Mapping for LCD_P11 signal
//   <o> LCD_P11 [PTB11]<name=LCD_P11_PIN_SEL>
//   <i> Shows which pin LCD_P11 is mapped to
//     <0=> Disabled
//     <1=> PTB11 (reset default)<selection=PTB11_SIG_SEL,LCD_P11 (reset default)>
//     <2=> PTB11<selection=PTB11_SIG_SEL,LCD_P11>
//     <1=> Default
#define LCD_P11_PIN_SEL      1
#if LCD_P11_PIN_SEL == 2
#define LCD_P11_GPIO         digitalIO_PTB11
#define LCD_P11_FN           0
#endif

// Pin Mapping for LCD_P11_fault signal
//   <o> LCD_P11_fault [PTB11]<name=LCD_P11_fault_PIN_SEL>
//   <i> Shows which pin LCD_P11_fault is mapped to
//     <0=> Disabled
//     <1=> PTB11<selection=PTB11_SIG_SEL,LCD_P11_fault>
//     <0=> Default
#define LCD_P11_fault_PIN_SEL 0
#if LCD_P11_fault_PIN_SEL == 1
#define LCD_P11_fault_GPIO   digitalIO_PTB11
#define LCD_P11_fault_FN     7
#endif

// Pin Mapping for LCD_P12 signal
//   <o> LCD_P12 [PTB16]<name=LCD_P12_PIN_SEL>
//   <i> Shows which pin LCD_P12 is mapped to
//     <0=> Disabled
//     <1=> PTB16 (reset default)<selection=PTB16_SIG_SEL,LCD_P12/TSI0_CH9 (reset default)>
//     <2=> PTB16<selection=PTB16_SIG_SEL,LCD_P12/TSI0_CH9>
//     <1=> Default
#define LCD_P12_PIN_SEL      1
#if LCD_P12_PIN_SEL == 2
#define LCD_P12_GPIO         digitalIO_PTB16
#define LCD_P12_FN           0
#endif

// Pin Mapping for LCD_P12_fault signal
//   <o> LCD_P12_fault [PTB16]<name=LCD_P12_fault_PIN_SEL>
//   <i> Shows which pin LCD_P12_fault is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,LCD_P12_fault>
//     <0=> Default
#define LCD_P12_fault_PIN_SEL 0
#if LCD_P12_fault_PIN_SEL == 1
#define LCD_P12_fault_GPIO   digitalIO_PTB16
#define LCD_P12_fault_FN     7
#endif

