podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P13 signal
//   <o> LCD_P13 [PTB17]<name=LCD_P13_PIN_SEL>
//   <i> Shows which pin LCD_P13 is mapped to
//     <0=> Disabled
//     <1=> PTB17 (reset default)<selection=PTB17_SIG_SEL,LCD_P13/TSI0_CH10 (reset default)>
//     <2=> PTB17<selection=PTB17_SIG_SEL,LCD_P13/TSI0_CH10>
//     <1=> Default
#define LCD_P13_PIN_SEL      1
#if LCD_P13_PIN_SEL == 2
#define LCD_P13_GPIO         digitalIO_PTB17
#define LCD_P13_FN           0
#endif

// Pin Mapping for LCD_P13_fault signal
//   <o> LCD_P13_fault [PTB17]<name=LCD_P13_fault_PIN_SEL>
//   <i> Shows which pin LCD_P13_fault is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,LCD_P13_fault>
//     <0=> Default
#define LCD_P13_fault_PIN_SEL 0
#if LCD_P13_fault_PIN_SEL == 1
#define LCD_P13_fault_GPIO   digitalIO_PTB17
#define LCD_P13_fault_FN     7
#endif

// Pin Mapping for LCD_P14 signal
//   <o> LCD_P14 [PTB18]<name=LCD_P14_PIN_SEL>
//   <i> Shows which pin LCD_P14 is mapped to
//     <0=> Disabled
//     <1=> PTB18 (reset default)<selection=PTB18_SIG_SEL,LCD_P14/TSI0_CH11 (reset default)>
//     <2=> PTB18<selection=PTB18_SIG_SEL,LCD_P14/TSI0_CH11>
//     <1=> Default
#define LCD_P14_PIN_SEL      1
#if LCD_P14_PIN_SEL == 2
#define LCD_P14_GPIO         digitalIO_PTB18
#define LCD_P14_FN           0
#endif

// Pin Mapping for LCD_P14_fault signal
//   <o> LCD_P14_fault [PTB18]<name=LCD_P14_fault_PIN_SEL>
//   <i> Shows which pin LCD_P14_fault is mapped to
//     <0=> Disabled
//     <1=> PTB18<selection=PTB18_SIG_SEL,LCD_P14_fault>
//     <0=> Default
#define LCD_P14_fault_PIN_SEL 0
#if LCD_P14_fault_PIN_SEL == 1
#define LCD_P14_fault_GPIO   digitalIO_PTB18
#define LCD_P14_fault_FN     7
#endif

// Pin Mapping for LCD_P15 signal
//   <o> LCD_P15 [PTB19]<name=LCD_P15_PIN_SEL>
//   <i> Shows which pin LCD_P15 is mapped to
//     <0=> Disabled
//     <1=> PTB19 (reset default)<selection=PTB19_SIG_SEL,LCD_P15/TSI0_CH12 (reset default)>
//     <2=> PTB19<selection=PTB19_SIG_SEL,LCD_P15/TSI0_CH12>
//     <1=> Default
#define LCD_P15_PIN_SEL      1
#if LCD_P15_PIN_SEL == 2
#define LCD_P15_GPIO         digitalIO_PTB19
#define LCD_P15_FN           0
#endif

// Pin Mapping for LCD_P15_fault signal
//   <o> LCD_P15_fault [PTB19]<name=LCD_P15_fault_PIN_SEL>
//   <i> Shows which pin LCD_P15_fault is mapped to
//     <0=> Disabled
//     <1=> PTB19<selection=PTB19_SIG_SEL,LCD_P15_fault>
//     <0=> Default
#define LCD_P15_fault_PIN_SEL 0
#if LCD_P15_fault_PIN_SEL == 1
#define LCD_P15_fault_GPIO   digitalIO_PTB19
#define LCD_P15_fault_FN     7
#endif

// Pin Mapping for LCD_P16 signal
//   <o> LCD_P16 [PTB20]<name=LCD_P16_PIN_SEL>
//   <i> Shows which pin LCD_P16 is mapped to
//     <0=> Disabled
//     <1=> PTB20 (reset default)<selection=PTB20_SIG_SEL,LCD_P16 (reset default)>
//     <2=> PTB20<selection=PTB20_SIG_SEL,LCD_P16>
//     <1=> Default
#define LCD_P16_PIN_SEL      1
#if LCD_P16_PIN_SEL == 2
#define LCD_P16_GPIO         digitalIO_PTB20
#define LCD_P16_FN           0
#endif

// Pin Mapping for LCD_P16_fault signal
//   <o> LCD_P16_fault [PTB20]<name=LCD_P16_fault_PIN_SEL>
//   <i> Shows which pin LCD_P16_fault is mapped to
//     <0=> Disabled
//     <1=> PTB20<selection=PTB20_SIG_SEL,LCD_P16_fault>
//     <0=> Default
#define LCD_P16_fault_PIN_SEL 0
#if LCD_P16_fault_PIN_SEL == 1
#define LCD_P16_fault_GPIO   digitalIO_PTB20
#define LCD_P16_fault_FN     7
#endif

// Pin Mapping for LCD_P17 signal
//   <o> LCD_P17 [PTB21]<name=LCD_P17_PIN_SEL>
//   <i> Shows which pin LCD_P17 is mapped to
//     <0=> Disabled
//     <1=> PTB21 (reset default)<selection=PTB21_SIG_SEL,LCD_P17 (reset default)>
//     <2=> PTB21<selection=PTB21_SIG_SEL,LCD_P17>
//     <1=> Default
#define LCD_P17_PIN_SEL      1
#if LCD_P17_PIN_SEL == 2
#define LCD_P17_GPIO         digitalIO_PTB21
#define LCD_P17_FN           0
#endif

// Pin Mapping for LCD_P17_fault signal
//   <o> LCD_P17_fault [PTB21]<name=LCD_P17_fault_PIN_SEL>
//   <i> Shows which pin LCD_P17_fault is mapped to
//     <0=> Disabled
//     <1=> PTB21<selection=PTB21_SIG_SEL,LCD_P17_fault>
//     <0=> Default
#define LCD_P17_fault_PIN_SEL 0
#if LCD_P17_fault_PIN_SEL == 1
#define LCD_P17_fault_GPIO   digitalIO_PTB21
#define LCD_P17_fault_FN     7
#endif

// Pin Mapping for LCD_P18 signal
//   <o> LCD_P18 [PTB22]<name=LCD_P18_PIN_SEL>
//   <i> Shows which pin LCD_P18 is mapped to
//     <0=> Disabled
//     <1=> PTB22 (reset default)<selection=PTB22_SIG_SEL,LCD_P18 (reset default)>
//     <2=> PTB22<selection=PTB22_SIG_SEL,LCD_P18>
//     <1=> Default
#define LCD_P18_PIN_SEL      1
#if LCD_P18_PIN_SEL == 2
#define LCD_P18_GPIO         digitalIO_PTB22
#define LCD_P18_FN           0
#endif

// Pin Mapping for LCD_P18_fault signal
//   <o> LCD_P18_fault [PTB22]<name=LCD_P18_fault_PIN_SEL>
//   <i> Shows which pin LCD_P18_fault is mapped to
//     <0=> Disabled
//     <1=> PTB22<selection=PTB22_SIG_SEL,LCD_P18_fault>
//     <0=> Default
#define LCD_P18_fault_PIN_SEL 0
#if LCD_P18_fault_PIN_SEL == 1
#define LCD_P18_fault_GPIO   digitalIO_PTB22
#define LCD_P18_fault_FN     7
#endif

// Pin Mapping for LCD_P19 signal
//   <o> LCD_P19 [PTB23]<name=LCD_P19_PIN_SEL>
//   <i> Shows which pin LCD_P19 is mapped to
//     <0=> Disabled
//     <1=> PTB23 (reset default)<selection=PTB23_SIG_SEL,LCD_P19 (reset default)>
//     <2=> PTB23<selection=PTB23_SIG_SEL,LCD_P19>
//     <1=> Default
#define LCD_P19_PIN_SEL      1
#if LCD_P19_PIN_SEL == 2
#define LCD_P19_GPIO         digitalIO_PTB23
#define LCD_P19_FN           0
#endif

// Pin Mapping for LCD_P19_fault signal
//   <o> LCD_P19_fault [PTB23]<name=LCD_P19_fault_PIN_SEL>
//   <i> Shows which pin LCD_P19_fault is mapped to
//     <0=> Disabled
//     <1=> PTB23<selection=PTB23_SIG_SEL,LCD_P19_fault>
//     <0=> Default
#define LCD_P19_fault_PIN_SEL 0
#if LCD_P19_fault_PIN_SEL == 1
#define LCD_P19_fault_GPIO   digitalIO_PTB23
#define LCD_P19_fault_FN     7
#endif

// Pin Mapping for LCD_P20 signal
//   <o> LCD_P20 [PTC0]<name=LCD_P20_PIN_SEL>
//   <i> Shows which pin LCD_P20 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13>
//     <1=> Default
#define LCD_P20_PIN_SEL      1
#if LCD_P20_PIN_SEL == 2
#define LCD_P20_GPIO         digitalIO_PTC0
#define LCD_P20_FN           0
#endif

// Pin Mapping for LCD_P20_fault signal
//   <o> LCD_P20_fault [PTC0]<name=LCD_P20_fault_PIN_SEL>
//   <i> Shows which pin LCD_P20_fault is mapped to
//     <0=> Disabled
//     <1=> PTC0<selection=PTC0_SIG_SEL,LCD_P20_fault>
//     <0=> Default
#define LCD_P20_fault_PIN_SEL 0
#if LCD_P20_fault_PIN_SEL == 1
#define LCD_P20_fault_GPIO   digitalIO_PTC0
#define LCD_P20_fault_FN     7
#endif

