podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P21 signal
//   <o> LCD_P21 [PTC1]<name=LCD_P21_PIN_SEL>
//   <i> Shows which pin LCD_P21 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (reset default)<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14 (reset default)>
//     <2=> PTC1<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14>
//     <2=> Default
#define LCD_P21_PIN_SEL      2
#if LCD_P21_PIN_SEL == 2
#define LCD_P21_GPIO         digitalIO_PTC1
#define LCD_P21_FN           0
#endif

// Pin Mapping for LCD_P21_fault signal
//   <o> LCD_P21_fault [PTC1]<name=LCD_P21_fault_PIN_SEL>
//   <i> Shows which pin LCD_P21_fault is mapped to
//     <0=> Disabled
//     <1=> PTC1<selection=PTC1_SIG_SEL,LCD_P21_fault>
//     <0=> Default
#define LCD_P21_fault_PIN_SEL 0
#if LCD_P21_fault_PIN_SEL == 1
#define LCD_P21_fault_GPIO   digitalIO_PTC1
#define LCD_P21_fault_FN     7
#endif

// Pin Mapping for LCD_P22 signal
//   <o> LCD_P22 [PTC2]<name=LCD_P22_PIN_SEL>
//   <i> Shows which pin LCD_P22 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (reset default)<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15 (reset default)>
//     <2=> PTC2<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15>
//     <2=> Default
#define LCD_P22_PIN_SEL      2
#if LCD_P22_PIN_SEL == 2
#define LCD_P22_GPIO         digitalIO_PTC2
#define LCD_P22_FN           0
#endif

// Pin Mapping for LCD_P22_fault signal
//   <o> LCD_P22_fault [PTC2]<name=LCD_P22_fault_PIN_SEL>
//   <i> Shows which pin LCD_P22_fault is mapped to
//     <0=> Disabled
//     <1=> PTC2<selection=PTC2_SIG_SEL,LCD_P22_fault>
//     <0=> Default
#define LCD_P22_fault_PIN_SEL 0
#if LCD_P22_fault_PIN_SEL == 1
#define LCD_P22_fault_GPIO   digitalIO_PTC2
#define LCD_P22_fault_FN     7
#endif

// Pin Mapping for LCD_P23 signal
//   <o> LCD_P23 [PTC3]<name=LCD_P23_PIN_SEL>
//   <i> Shows which pin LCD_P23 is mapped to
//     <0=> Disabled
//     <1=> PTC3 (reset default)<selection=PTC3_SIG_SEL,LCD_P23 (reset default)>
//     <2=> PTC3<selection=PTC3_SIG_SEL,LCD_P23>
//     <1=> Default
#define LCD_P23_PIN_SEL      1
#if LCD_P23_PIN_SEL == 2
#define LCD_P23_GPIO         digitalIO_PTC3
#define LCD_P23_FN           0
#endif

// Pin Mapping for LCD_P23_fault signal
//   <o> LCD_P23_fault [PTC3]<name=LCD_P23_fault_PIN_SEL>
//   <i> Shows which pin LCD_P23_fault is mapped to
//     <0=> Disabled
//     <1=> PTC3<selection=PTC3_SIG_SEL,LCD_P23_fault>
//     <0=> Default
#define LCD_P23_fault_PIN_SEL 0
#if LCD_P23_fault_PIN_SEL == 1
#define LCD_P23_fault_GPIO   digitalIO_PTC3
#define LCD_P23_fault_FN     7
#endif

// Pin Mapping for LCD_P24 signal
//   <o> LCD_P24 [PTC4]<name=LCD_P24_PIN_SEL>
//   <i> Shows which pin LCD_P24 is mapped to
//     <0=> Disabled
//     <1=> PTC4 (reset default)<selection=PTC4_SIG_SEL,LCD_P24 (reset default)>
//     <2=> PTC4<selection=PTC4_SIG_SEL,LCD_P24>
//     <1=> Default
#define LCD_P24_PIN_SEL      1
#if LCD_P24_PIN_SEL == 2
#define LCD_P24_GPIO         digitalIO_PTC4
#define LCD_P24_FN           0
#endif

// Pin Mapping for LCD_P24_fault signal
//   <o> LCD_P24_fault [PTC4]<name=LCD_P24_fault_PIN_SEL>
//   <i> Shows which pin LCD_P24_fault is mapped to
//     <0=> Disabled
//     <1=> PTC4<selection=PTC4_SIG_SEL,LCD_P24_fault>
//     <0=> Default
#define LCD_P24_fault_PIN_SEL 0
#if LCD_P24_fault_PIN_SEL == 1
#define LCD_P24_fault_GPIO   digitalIO_PTC4
#define LCD_P24_fault_FN     7
#endif

// Pin Mapping for LCD_P25 signal
//   <o> LCD_P25 [PTC5]<name=LCD_P25_PIN_SEL>
//   <i> Shows which pin LCD_P25 is mapped to
//     <0=> Disabled
//     <1=> PTC5 (reset default)<selection=PTC5_SIG_SEL,LCD_P25 (reset default)>
//     <2=> PTC5<selection=PTC5_SIG_SEL,LCD_P25>
//     <0=> Default
#define LCD_P25_PIN_SEL      0
#if LCD_P25_PIN_SEL == 2
#define LCD_P25_GPIO         digitalIO_PTC5
#define LCD_P25_FN           0
#endif

// Pin Mapping for LCD_P25_fault signal
//   <o> LCD_P25_fault [PTC5]<name=LCD_P25_fault_PIN_SEL>
//   <i> Shows which pin LCD_P25_fault is mapped to
//     <0=> Disabled
//     <1=> PTC5<selection=PTC5_SIG_SEL,LCD_P25_fault>
//     <0=> Default
#define LCD_P25_fault_PIN_SEL 0
#if LCD_P25_fault_PIN_SEL == 1
#define LCD_P25_fault_GPIO   digitalIO_PTC5
#define LCD_P25_fault_FN     7
#endif

// Pin Mapping for LCD_P26 signal
//   <o> LCD_P26 [PTC6]<name=LCD_P26_PIN_SEL>
//   <i> Shows which pin LCD_P26 is mapped to
//     <0=> Disabled
//     <1=> PTC6 (reset default)<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0 (reset default)>
//     <2=> PTC6<selection=PTC6_SIG_SEL,LCD_P26/CMP0_IN0>
//     <1=> Default
#define LCD_P26_PIN_SEL      1
#if LCD_P26_PIN_SEL == 2
#define LCD_P26_GPIO         digitalIO_PTC6
#define LCD_P26_FN           0
#endif

// Pin Mapping for LCD_P26_fault signal
//   <o> LCD_P26_fault [PTC6]<name=LCD_P26_fault_PIN_SEL>
//   <i> Shows which pin LCD_P26_fault is mapped to
//     <0=> Disabled
//     <1=> PTC6<selection=PTC6_SIG_SEL,LCD_P26_fault>
//     <0=> Default
#define LCD_P26_fault_PIN_SEL 0
#if LCD_P26_fault_PIN_SEL == 1
#define LCD_P26_fault_GPIO   digitalIO_PTC6
#define LCD_P26_fault_FN     7
#endif

// Pin Mapping for LCD_P27 signal
//   <o> LCD_P27 [PTC7]<name=LCD_P27_PIN_SEL>
//   <i> Shows which pin LCD_P27 is mapped to
//     <0=> Disabled
//     <1=> PTC7 (reset default)<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1 (reset default)>
//     <2=> PTC7<selection=PTC7_SIG_SEL,LCD_P27/CMP0_IN1>
//     <1=> Default
#define LCD_P27_PIN_SEL      1
#if LCD_P27_PIN_SEL == 2
#define LCD_P27_GPIO         digitalIO_PTC7
#define LCD_P27_FN           0
#endif

// Pin Mapping for LCD_P27_fault signal
//   <o> LCD_P27_fault [PTC7]<name=LCD_P27_fault_PIN_SEL>
//   <i> Shows which pin LCD_P27_fault is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,LCD_P27_fault>
//     <0=> Default
#define LCD_P27_fault_PIN_SEL 0
#if LCD_P27_fault_PIN_SEL == 1
#define LCD_P27_fault_GPIO   digitalIO_PTC7
#define LCD_P27_fault_FN     7
#endif

// Pin Mapping for LCD_P28 signal
//   <o> LCD_P28 [PTC8]<name=LCD_P28_PIN_SEL>
//   <i> Shows which pin LCD_P28 is mapped to
//     <0=> Disabled
//     <1=> PTC8 (reset default)<selection=PTC8_SIG_SEL,LCD_P28/CMP0_IN2 (reset default)>
//     <2=> PTC8<selection=PTC8_SIG_SEL,LCD_P28/CMP0_IN2>
//     <0=> Default
#define LCD_P28_PIN_SEL      0
#if LCD_P28_PIN_SEL == 2
#define LCD_P28_GPIO         digitalIO_PTC8
#define LCD_P28_FN           0
#endif

// Pin Mapping for LCD_P28_fault signal
//   <o> LCD_P28_fault [PTC8]<name=LCD_P28_fault_PIN_SEL>
//   <i> Shows which pin LCD_P28_fault is mapped to
//     <0=> Disabled
//     <1=> PTC8<selection=PTC8_SIG_SEL,LCD_P28_fault>
//     <0=> Default
#define LCD_P28_fault_PIN_SEL 0
#if LCD_P28_fault_PIN_SEL == 1
#define LCD_P28_fault_GPIO   digitalIO_PTC8
#define LCD_P28_fault_FN     7
#endif

// Pin Mapping for LCD_P29 signal
//   <o> LCD_P29 [PTC9]<name=LCD_P29_PIN_SEL>
//   <i> Shows which pin LCD_P29 is mapped to
//     <0=> Disabled
//     <1=> PTC9 (reset default)<selection=PTC9_SIG_SEL,LCD_P29/CMP0_IN3 (reset default)>
//     <2=> PTC9<selection=PTC9_SIG_SEL,LCD_P29/CMP0_IN3>
//     <0=> Default
#define LCD_P29_PIN_SEL      0
#if LCD_P29_PIN_SEL == 2
#define LCD_P29_GPIO         digitalIO_PTC9
#define LCD_P29_FN           0
#endif

// Pin Mapping for LCD_P29_fault signal
//   <o> LCD_P29_fault [PTC9]<name=LCD_P29_fault_PIN_SEL>
//   <i> Shows which pin LCD_P29_fault is mapped to
//     <0=> Disabled
//     <1=> PTC9<selection=PTC9_SIG_SEL,LCD_P29_fault>
//     <0=> Default
#define LCD_P29_fault_PIN_SEL 0
#if LCD_P29_fault_PIN_SEL == 1
#define LCD_P29_fault_GPIO   digitalIO_PTC9
#define LCD_P29_fault_FN     7
#endif

// Pin Mapping for LCD_P30 signal
//   <o> LCD_P30 [PTC10]<name=LCD_P30_PIN_SEL>
//   <i> Shows which pin LCD_P30 is mapped to
//     <0=> Disabled
//     <1=> PTC10 (reset default)<selection=PTC10_SIG_SEL,LCD_P30 (reset default)>
//     <2=> PTC10<selection=PTC10_SIG_SEL,LCD_P30>
//     <1=> Default
#define LCD_P30_PIN_SEL      1
#if LCD_P30_PIN_SEL == 2
#define LCD_P30_GPIO         digitalIO_PTC10
#define LCD_P30_FN           0
#endif

// Pin Mapping for LCD_P30_fault signal
//   <o> LCD_P30_fault [PTC10]<name=LCD_P30_fault_PIN_SEL>
//   <i> Shows which pin LCD_P30_fault is mapped to
//     <0=> Disabled
//     <1=> PTC10<selection=PTC10_SIG_SEL,LCD_P30_fault>
//     <0=> Default
#define LCD_P30_fault_PIN_SEL 0
#if LCD_P30_fault_PIN_SEL == 1
#define LCD_P30_fault_GPIO   digitalIO_PTC10
#define LCD_P30_fault_FN     7
#endif

// Pin Mapping for LCD_P31 signal
//   <o> LCD_P31 [PTC11]<name=LCD_P31_PIN_SEL>
//   <i> Shows which pin LCD_P31 is mapped to
//     <0=> Disabled
//     <1=> PTC11 (reset default)<selection=PTC11_SIG_SEL,LCD_P31 (reset default)>
//     <2=> PTC11<selection=PTC11_SIG_SEL,LCD_P31>
//     <1=> Default
#define LCD_P31_PIN_SEL      1
#if LCD_P31_PIN_SEL == 2
#define LCD_P31_GPIO         digitalIO_PTC11
#define LCD_P31_FN           0
#endif

// Pin Mapping for LCD_P31_fault signal
//   <o> LCD_P31_fault [PTC11]<name=LCD_P31_fault_PIN_SEL>
//   <i> Shows which pin LCD_P31_fault is mapped to
//     <0=> Disabled
//     <1=> PTC11<selection=PTC11_SIG_SEL,LCD_P31_fault>
//     <0=> Default
#define LCD_P31_fault_PIN_SEL 0
#if LCD_P31_fault_PIN_SEL == 1
#define LCD_P31_fault_GPIO   digitalIO_PTC11
#define LCD_P31_fault_FN     7
#endif

