podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P32 signal
//   <o> LCD_P32 [PTC12]<name=LCD_P32_PIN_SEL>
//   <i> Shows which pin LCD_P32 is mapped to
//     <0=> Disabled
//     <1=> PTC12 (reset default)<selection=PTC12_SIG_SEL,LCD_P32 (reset default)>
//     <2=> PTC12<selection=PTC12_SIG_SEL,LCD_P32>
//     <1=> Default
#define LCD_P32_PIN_SEL      1
#if LCD_P32_PIN_SEL == 2
#define LCD_P32_GPIO         digitalIO_PTC12
#define LCD_P32_FN           0
#endif

// Pin Mapping for LCD_P32_fault signal
//   <o> LCD_P32_fault [PTC12]<name=LCD_P32_fault_PIN_SEL>
//   <i> Shows which pin LCD_P32_fault is mapped to
//     <0=> Disabled
//     <1=> PTC12<selection=PTC12_SIG_SEL,LCD_P32_fault>
//     <0=> Default
#define LCD_P32_fault_PIN_SEL 0
#if LCD_P32_fault_PIN_SEL == 1
#define LCD_P32_fault_GPIO   digitalIO_PTC12
#define LCD_P32_fault_FN     7
#endif

// Pin Mapping for LCD_P33 signal
//   <o> LCD_P33 [PTC13]<name=LCD_P33_PIN_SEL>
//   <i> Shows which pin LCD_P33 is mapped to
//     <0=> Disabled
//     <1=> PTC13 (reset default)<selection=PTC13_SIG_SEL,LCD_P33 (reset default)>
//     <2=> PTC13<selection=PTC13_SIG_SEL,LCD_P33>
//     <1=> Default
#define LCD_P33_PIN_SEL      1
#if LCD_P33_PIN_SEL == 2
#define LCD_P33_GPIO         digitalIO_PTC13
#define LCD_P33_FN           0
#endif

// Pin Mapping for LCD_P33_fault signal
//   <o> LCD_P33_fault [PTC13]<name=LCD_P33_fault_PIN_SEL>
//   <i> Shows which pin LCD_P33_fault is mapped to
//     <0=> Disabled
//     <1=> PTC13<selection=PTC13_SIG_SEL,LCD_P33_fault>
//     <0=> Default
#define LCD_P33_fault_PIN_SEL 0
#if LCD_P33_fault_PIN_SEL == 1
#define LCD_P33_fault_GPIO   digitalIO_PTC13
#define LCD_P33_fault_FN     7
#endif

// Pin Mapping for LCD_P36 signal
//   <o> LCD_P36 [PTC16]<name=LCD_P36_PIN_SEL>
//   <i> Shows which pin LCD_P36 is mapped to
//     <0=> Disabled
//     <1=> PTC16 (reset default)<selection=PTC16_SIG_SEL,LCD_P36 (reset default)>
//     <2=> PTC16<selection=PTC16_SIG_SEL,LCD_P36>
//     <1=> Default
#define LCD_P36_PIN_SEL      1
#if LCD_P36_PIN_SEL == 2
#define LCD_P36_GPIO         digitalIO_PTC16
#define LCD_P36_FN           0
#endif

// Pin Mapping for LCD_P36_fault signal
//   <o> LCD_P36_fault [PTC16]<name=LCD_P36_fault_PIN_SEL>
//   <i> Shows which pin LCD_P36_fault is mapped to
//     <0=> Disabled
//     <1=> PTC16<selection=PTC16_SIG_SEL,LCD_P36_fault>
//     <0=> Default
#define LCD_P36_fault_PIN_SEL 0
#if LCD_P36_fault_PIN_SEL == 1
#define LCD_P36_fault_GPIO   digitalIO_PTC16
#define LCD_P36_fault_FN     7
#endif

// Pin Mapping for LCD_P37 signal
//   <o> LCD_P37 [PTC17]<name=LCD_P37_PIN_SEL>
//   <i> Shows which pin LCD_P37 is mapped to
//     <0=> Disabled
//     <1=> PTC17 (reset default)<selection=PTC17_SIG_SEL,LCD_P37 (reset default)>
//     <2=> PTC17<selection=PTC17_SIG_SEL,LCD_P37>
//     <1=> Default
#define LCD_P37_PIN_SEL      1
#if LCD_P37_PIN_SEL == 2
#define LCD_P37_GPIO         digitalIO_PTC17
#define LCD_P37_FN           0
#endif

// Pin Mapping for LCD_P37_fault signal
//   <o> LCD_P37_fault [PTC17]<name=LCD_P37_fault_PIN_SEL>
//   <i> Shows which pin LCD_P37_fault is mapped to
//     <0=> Disabled
//     <1=> PTC17<selection=PTC17_SIG_SEL,LCD_P37_fault>
//     <0=> Default
#define LCD_P37_fault_PIN_SEL 0
#if LCD_P37_fault_PIN_SEL == 1
#define LCD_P37_fault_GPIO   digitalIO_PTC17
#define LCD_P37_fault_FN     7
#endif

// Pin Mapping for LCD_P38 signal
//   <o> LCD_P38 [PTC18]<name=LCD_P38_PIN_SEL>
//   <i> Shows which pin LCD_P38 is mapped to
//     <0=> Disabled
//     <1=> PTC18 (reset default)<selection=PTC18_SIG_SEL,LCD_P38 (reset default)>
//     <2=> PTC18<selection=PTC18_SIG_SEL,LCD_P38>
//     <1=> Default
#define LCD_P38_PIN_SEL      1
#if LCD_P38_PIN_SEL == 2
#define LCD_P38_GPIO         digitalIO_PTC18
#define LCD_P38_FN           0
#endif

// Pin Mapping for LCD_P38_fault signal
//   <o> LCD_P38_fault [PTC18]<name=LCD_P38_fault_PIN_SEL>
//   <i> Shows which pin LCD_P38_fault is mapped to
//     <0=> Disabled
//     <1=> PTC18<selection=PTC18_SIG_SEL,LCD_P38_fault>
//     <0=> Default
#define LCD_P38_fault_PIN_SEL 0
#if LCD_P38_fault_PIN_SEL == 1
#define LCD_P38_fault_GPIO   digitalIO_PTC18
#define LCD_P38_fault_FN     7
#endif

// Pin Mapping for LCD_P40 signal
//   <o> LCD_P40 [PTD0]<name=LCD_P40_PIN_SEL>
//   <i> Shows which pin LCD_P40 is mapped to
//     <0=> Disabled
//     <1=> PTD0 (reset default)<selection=PTD0_SIG_SEL,LCD_P40 (reset default)>
//     <2=> PTD0<selection=PTD0_SIG_SEL,LCD_P40>
//     <1=> Default
#define LCD_P40_PIN_SEL      1
#if LCD_P40_PIN_SEL == 2
#define LCD_P40_GPIO         digitalIO_PTD0
#define LCD_P40_FN           0
#endif

// Pin Mapping for LCD_P40_fault signal
//   <o> LCD_P40_fault [PTD0]<name=LCD_P40_fault_PIN_SEL>
//   <i> Shows which pin LCD_P40_fault is mapped to
//     <0=> Disabled
//     <1=> PTD0<selection=PTD0_SIG_SEL,LCD_P40_fault>
//     <0=> Default
#define LCD_P40_fault_PIN_SEL 0
#if LCD_P40_fault_PIN_SEL == 1
#define LCD_P40_fault_GPIO   digitalIO_PTD0
#define LCD_P40_fault_FN     7
#endif

// Pin Mapping for LCD_P41 signal
//   <o> LCD_P41 [PTD1]<name=LCD_P41_PIN_SEL>
//   <i> Shows which pin LCD_P41 is mapped to
//     <0=> Disabled
//     <1=> PTD1 (reset default)<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b (reset default)>
//     <2=> PTD1<selection=PTD1_SIG_SEL,LCD_P41/ADC0_SE5b>
//     <0=> Default
#define LCD_P41_PIN_SEL      0
#if LCD_P41_PIN_SEL == 2
#define LCD_P41_GPIO         digitalIO_PTD1
#define LCD_P41_FN           0
#endif

// Pin Mapping for LCD_P41_fault signal
//   <o> LCD_P41_fault [PTD1]<name=LCD_P41_fault_PIN_SEL>
//   <i> Shows which pin LCD_P41_fault is mapped to
//     <0=> Disabled
//     <1=> PTD1<selection=PTD1_SIG_SEL,LCD_P41_fault>
//     <0=> Default
#define LCD_P41_fault_PIN_SEL 0
#if LCD_P41_fault_PIN_SEL == 1
#define LCD_P41_fault_GPIO   digitalIO_PTD1
#define LCD_P41_fault_FN     7
#endif

// Pin Mapping for LCD_P42 signal
//   <o> LCD_P42 [PTD2]<name=LCD_P42_PIN_SEL>
//   <i> Shows which pin LCD_P42 is mapped to
//     <0=> Disabled
//     <1=> PTD2 (reset default)<selection=PTD2_SIG_SEL,LCD_P42 (reset default)>
//     <2=> PTD2<selection=PTD2_SIG_SEL,LCD_P42>
//     <0=> Default
#define LCD_P42_PIN_SEL      0
#if LCD_P42_PIN_SEL == 2
#define LCD_P42_GPIO         digitalIO_PTD2
#define LCD_P42_FN           0
#endif

