podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P42_fault signal
//   <o> LCD_P42_fault [PTD2]<name=LCD_P42_fault_PIN_SEL>
//   <i> Shows which pin LCD_P42_fault is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,LCD_P42_fault>
//     <0=> Default
#define LCD_P42_fault_PIN_SEL 0
#if LCD_P42_fault_PIN_SEL == 1
#define LCD_P42_fault_GPIO   digitalIO_PTD2
#define LCD_P42_fault_FN     7
#endif

// Pin Mapping for LCD_P43 signal
//   <o> LCD_P43 [PTD3]<name=LCD_P43_PIN_SEL>
//   <i> Shows which pin LCD_P43 is mapped to
//     <0=> Disabled
//     <1=> PTD3 (reset default)<selection=PTD3_SIG_SEL,LCD_P43 (reset default)>
//     <2=> PTD3<selection=PTD3_SIG_SEL,LCD_P43>
//     <0=> Default
#define LCD_P43_PIN_SEL      0
#if LCD_P43_PIN_SEL == 2
#define LCD_P43_GPIO         digitalIO_PTD3
#define LCD_P43_FN           0
#endif

// Pin Mapping for LCD_P43_fault signal
//   <o> LCD_P43_fault [PTD3]<name=LCD_P43_fault_PIN_SEL>
//   <i> Shows which pin LCD_P43_fault is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,LCD_P43_fault>
//     <0=> Default
#define LCD_P43_fault_PIN_SEL 0
#if LCD_P43_fault_PIN_SEL == 1
#define LCD_P43_fault_GPIO   digitalIO_PTD3
#define LCD_P43_fault_FN     7
#endif

// Pin Mapping for LCD_P44 signal
//   <o> LCD_P44 [PTD4]<name=LCD_P44_PIN_SEL>
//   <i> Shows which pin LCD_P44 is mapped to
//     <0=> Disabled
//     <1=> PTD4 (reset default)<selection=PTD4_SIG_SEL,LCD_P44 (reset default)>
//     <2=> PTD4<selection=PTD4_SIG_SEL,LCD_P44>
//     <0=> Default
#define LCD_P44_PIN_SEL      0
#if LCD_P44_PIN_SEL == 2
#define LCD_P44_GPIO         digitalIO_PTD4
#define LCD_P44_FN           0
#endif

// Pin Mapping for LCD_P44_fault signal
//   <o> LCD_P44_fault [PTD4]<name=LCD_P44_fault_PIN_SEL>
//   <i> Shows which pin LCD_P44_fault is mapped to
//     <0=> Disabled
//     <1=> PTD4<selection=PTD4_SIG_SEL,LCD_P44_fault>
//     <0=> Default
#define LCD_P44_fault_PIN_SEL 0
#if LCD_P44_fault_PIN_SEL == 1
#define LCD_P44_fault_GPIO   digitalIO_PTD4
#define LCD_P44_fault_FN     7
#endif

// Pin Mapping for LCD_P45 signal
//   <o> LCD_P45 [PTD5]<name=LCD_P45_PIN_SEL>
//   <i> Shows which pin LCD_P45 is mapped to
//     <0=> Disabled
//     <1=> PTD5 (reset default)<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b (reset default)>
//     <2=> PTD5<selection=PTD5_SIG_SEL,LCD_P45/ADC0_SE6b>
//     <0=> Default
#define LCD_P45_PIN_SEL      0
#if LCD_P45_PIN_SEL == 2
#define LCD_P45_GPIO         digitalIO_PTD5
#define LCD_P45_FN           0
#endif

// Pin Mapping for LCD_P45_fault signal
//   <o> LCD_P45_fault [PTD5]<name=LCD_P45_fault_PIN_SEL>
//   <i> Shows which pin LCD_P45_fault is mapped to
//     <0=> Disabled
//     <1=> PTD5<selection=PTD5_SIG_SEL,LCD_P45_fault>
//     <0=> Default
#define LCD_P45_fault_PIN_SEL 0
#if LCD_P45_fault_PIN_SEL == 1
#define LCD_P45_fault_GPIO   digitalIO_PTD5
#define LCD_P45_fault_FN     7
#endif

// Pin Mapping for LCD_P46 signal
//   <o> LCD_P46 [PTD6]<name=LCD_P46_PIN_SEL>
//   <i> Shows which pin LCD_P46 is mapped to
//     <0=> Disabled
//     <1=> PTD6 (reset default)<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b (reset default)>
//     <2=> PTD6<selection=PTD6_SIG_SEL,LCD_P46/ADC0_SE7b>
//     <0=> Default
#define LCD_P46_PIN_SEL      0
#if LCD_P46_PIN_SEL == 2
#define LCD_P46_GPIO         digitalIO_PTD6
#define LCD_P46_FN           0
#endif

// Pin Mapping for LCD_P46_fault signal
//   <o> LCD_P46_fault [PTD6]<name=LCD_P46_fault_PIN_SEL>
//   <i> Shows which pin LCD_P46_fault is mapped to
//     <0=> Disabled
//     <1=> PTD6<selection=PTD6_SIG_SEL,LCD_P46_fault>
//     <0=> Default
#define LCD_P46_fault_PIN_SEL 0
#if LCD_P46_fault_PIN_SEL == 1
#define LCD_P46_fault_GPIO   digitalIO_PTD6
#define LCD_P46_fault_FN     7
#endif

// Pin Mapping for LCD_P47 signal
//   <o> LCD_P47 [PTD7]<name=LCD_P47_PIN_SEL>
//   <i> Shows which pin LCD_P47 is mapped to
//     <0=> Disabled
//     <1=> PTD7 (reset default)<selection=PTD7_SIG_SEL,LCD_P47 (reset default)>
//     <2=> PTD7<selection=PTD7_SIG_SEL,LCD_P47>
//     <0=> Default
#define LCD_P47_PIN_SEL      0
#if LCD_P47_PIN_SEL == 2
#define LCD_P47_GPIO         digitalIO_PTD7
#define LCD_P47_FN           0
#endif

// Pin Mapping for LCD_P47_fault signal
//   <o> LCD_P47_fault [PTD7]<name=LCD_P47_fault_PIN_SEL>
//   <i> Shows which pin LCD_P47_fault is mapped to
//     <0=> Disabled
//     <1=> PTD7<selection=PTD7_SIG_SEL,LCD_P47_fault>
//     <0=> Default
#define LCD_P47_fault_PIN_SEL 0
#if LCD_P47_fault_PIN_SEL == 1
#define LCD_P47_fault_GPIO   digitalIO_PTD7
#define LCD_P47_fault_FN     7
#endif

// Pin Mapping for LCD_P48 signal
//   <o> LCD_P48 [PTE0]<name=LCD_P48_PIN_SEL>
//   <i> Shows which pin LCD_P48 is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,LCD_P48>
//     <0=> Default
#define LCD_P48_PIN_SEL      0
#if LCD_P48_PIN_SEL == 1
#define LCD_P48_GPIO         digitalIO_PTE0
#define LCD_P48_FN           0
#endif

// Pin Mapping for LCD_P48_fault signal
//   <o> LCD_P48_fault [PTE0]<name=LCD_P48_fault_PIN_SEL>
//   <i> Shows which pin LCD_P48_fault is mapped to
//     <0=> Disabled
//     <1=> PTE0<selection=PTE0_SIG_SEL,LCD_P48_fault>
//     <0=> Default
#define LCD_P48_fault_PIN_SEL 0
#if LCD_P48_fault_PIN_SEL == 1
#define LCD_P48_fault_GPIO   digitalIO_PTE0
#define LCD_P48_fault_FN     7
#endif

// Pin Mapping for LCD_P49 signal
//   <o> LCD_P49 [PTE1]<name=LCD_P49_PIN_SEL>
//   <i> Shows which pin LCD_P49 is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,LCD_P49>
//     <0=> Default
#define LCD_P49_PIN_SEL      0
#if LCD_P49_PIN_SEL == 1
#define LCD_P49_GPIO         digitalIO_PTE1
#define LCD_P49_FN           0
#endif

// Pin Mapping for LCD_P49_fault signal
//   <o> LCD_P49_fault [PTE1]<name=LCD_P49_fault_PIN_SEL>
//   <i> Shows which pin LCD_P49_fault is mapped to
//     <0=> Disabled
//     <1=> PTE1<selection=PTE1_SIG_SEL,LCD_P49_fault>
//     <0=> Default
#define LCD_P49_fault_PIN_SEL 0
#if LCD_P49_fault_PIN_SEL == 1
#define LCD_P49_fault_GPIO   digitalIO_PTE1
#define LCD_P49_fault_FN     7
#endif

// Pin Mapping for LCD_P50 signal
//   <o> LCD_P50 [PTE2]<name=LCD_P50_PIN_SEL>
//   <i> Shows which pin LCD_P50 is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,LCD_P50>
//     <0=> Default
#define LCD_P50_PIN_SEL      0
#if LCD_P50_PIN_SEL == 1
#define LCD_P50_GPIO         digitalIO_PTE2
#define LCD_P50_FN           0
#endif

// Pin Mapping for LCD_P50_fault signal
//   <o> LCD_P50_fault [PTE2]<name=LCD_P50_fault_PIN_SEL>
//   <i> Shows which pin LCD_P50_fault is mapped to
//     <0=> Disabled
//     <1=> PTE2<selection=PTE2_SIG_SEL,LCD_P50_fault>
//     <0=> Default
#define LCD_P50_fault_PIN_SEL 0
#if LCD_P50_fault_PIN_SEL == 1
#define LCD_P50_fault_GPIO   digitalIO_PTE2
#define LCD_P50_fault_FN     7
#endif

// Pin Mapping for LCD_P51 signal
//   <o> LCD_P51 [PTE3]<name=LCD_P51_PIN_SEL>
//   <i> Shows which pin LCD_P51 is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,LCD_P51>
//     <0=> Default
#define LCD_P51_PIN_SEL      0
#if LCD_P51_PIN_SEL == 1
#define LCD_P51_GPIO         digitalIO_PTE3
#define LCD_P51_FN           0
#endif

// Pin Mapping for LCD_P51_fault signal
//   <o> LCD_P51_fault [PTE3]<name=LCD_P51_fault_PIN_SEL>
//   <i> Shows which pin LCD_P51_fault is mapped to
//     <0=> Disabled
//     <1=> PTE3<selection=PTE3_SIG_SEL,LCD_P51_fault>
//     <0=> Default
#define LCD_P51_fault_PIN_SEL 0
#if LCD_P51_fault_PIN_SEL == 1
#define LCD_P51_fault_GPIO   digitalIO_PTE3
#define LCD_P51_fault_FN     7
#endif

// Pin Mapping for LCD_P52 signal
//   <o> LCD_P52 [PTE4]<name=LCD_P52_PIN_SEL>
//   <i> Shows which pin LCD_P52 is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,LCD_P52>
//     <0=> Default
#define LCD_P52_PIN_SEL      0
#if LCD_P52_PIN_SEL == 1
#define LCD_P52_GPIO         digitalIO_PTE4
#define LCD_P52_FN           0
#endif

