podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for LCD_P52_fault signal
//   <o> LCD_P52_fault [PTE4]<name=LCD_P52_fault_PIN_SEL>
//   <i> Shows which pin LCD_P52_fault is mapped to
//     <0=> Disabled
//     <1=> PTE4<selection=PTE4_SIG_SEL,LCD_P52_fault>
//     <0=> Default
#define LCD_P52_fault_PIN_SEL 0
#if LCD_P52_fault_PIN_SEL == 1
#define LCD_P52_fault_GPIO   digitalIO_PTE4
#define LCD_P52_fault_FN     7
#endif

// Pin Mapping for LCD_P53 signal
//   <o> LCD_P53 [PTE5]<name=LCD_P53_PIN_SEL>
//   <i> Shows which pin LCD_P53 is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,LCD_P53>
//     <0=> Default
#define LCD_P53_PIN_SEL      0
#if LCD_P53_PIN_SEL == 1
#define LCD_P53_GPIO         digitalIO_PTE5
#define LCD_P53_FN           0
#endif

// Pin Mapping for LCD_P53_fault signal
//   <o> LCD_P53_fault [PTE5]<name=LCD_P53_fault_PIN_SEL>
//   <i> Shows which pin LCD_P53_fault is mapped to
//     <0=> Disabled
//     <1=> PTE5<selection=PTE5_SIG_SEL,LCD_P53_fault>
//     <0=> Default
#define LCD_P53_fault_PIN_SEL 0
#if LCD_P53_fault_PIN_SEL == 1
#define LCD_P53_fault_GPIO   digitalIO_PTE5
#define LCD_P53_fault_FN     7
#endif

// Pin Mapping for LCD_P54 signal
//   <o> LCD_P54 [PTE6]<name=LCD_P54_PIN_SEL>
//   <i> Shows which pin LCD_P54 is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,LCD_P54>
//     <0=> Default
#define LCD_P54_PIN_SEL      0
#if LCD_P54_PIN_SEL == 1
#define LCD_P54_GPIO         digitalIO_PTE6
#define LCD_P54_FN           0
#endif

// Pin Mapping for LCD_P54_fault signal
//   <o> LCD_P54_fault [PTE6]<name=LCD_P54_fault_PIN_SEL>
//   <i> Shows which pin LCD_P54_fault is mapped to
//     <0=> Disabled
//     <1=> PTE6<selection=PTE6_SIG_SEL,LCD_P54_fault>
//     <0=> Default
#define LCD_P54_fault_PIN_SEL 0
#if LCD_P54_fault_PIN_SEL == 1
#define LCD_P54_fault_GPIO   digitalIO_PTE6
#define LCD_P54_fault_FN     7
#endif

// Pin Mapping for LCD_P55 signal
//   <o> LCD_P55 [PTE16]<name=LCD_P55_PIN_SEL>
//   <i> Shows which pin LCD_P55 is mapped to
//     <0=> Disabled
//     <1=> PTE16 (reset default)<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1 (reset default)>
//     <2=> PTE16<selection=PTE16_SIG_SEL,LCD_P55/ADC0_DP1/ADC0_SE1>
//     <1=> Default
#define LCD_P55_PIN_SEL      1
#if LCD_P55_PIN_SEL == 2
#define LCD_P55_GPIO         digitalIO_PTE16
#define LCD_P55_FN           0
#endif

// Pin Mapping for LCD_P55_fault signal
//   <o> LCD_P55_fault [PTE16]<name=LCD_P55_fault_PIN_SEL>
//   <i> Shows which pin LCD_P55_fault is mapped to
//     <0=> Disabled
//     <1=> PTE16<selection=PTE16_SIG_SEL,LCD_P55_fault>
//     <0=> Default
#define LCD_P55_fault_PIN_SEL 0
#if LCD_P55_fault_PIN_SEL == 1
#define LCD_P55_fault_GPIO   digitalIO_PTE16
#define LCD_P55_fault_FN     7
#endif

// Pin Mapping for LCD_P56 signal
//   <o> LCD_P56 [PTE17]<name=LCD_P56_PIN_SEL>
//   <i> Shows which pin LCD_P56 is mapped to
//     <0=> Disabled
//     <1=> PTE17 (reset default)<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a (reset default)>
//     <2=> PTE17<selection=PTE17_SIG_SEL,LCD_P56/ADC0_DM1/ADC0_SE5a>
//     <1=> Default
#define LCD_P56_PIN_SEL      1
#if LCD_P56_PIN_SEL == 2
#define LCD_P56_GPIO         digitalIO_PTE17
#define LCD_P56_FN           0
#endif

// Pin Mapping for LCD_P56_fault signal
//   <o> LCD_P56_fault [PTE17]<name=LCD_P56_fault_PIN_SEL>
//   <i> Shows which pin LCD_P56_fault is mapped to
//     <0=> Disabled
//     <1=> PTE17<selection=PTE17_SIG_SEL,LCD_P56_fault>
//     <0=> Default
#define LCD_P56_fault_PIN_SEL 0
#if LCD_P56_fault_PIN_SEL == 1
#define LCD_P56_fault_GPIO   digitalIO_PTE17
#define LCD_P56_fault_FN     7
#endif

// Pin Mapping for LCD_P57 signal
//   <o> LCD_P57 [PTE18]<name=LCD_P57_PIN_SEL>
//   <i> Shows which pin LCD_P57 is mapped to
//     <0=> Disabled
//     <1=> PTE18 (reset default)<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2 (reset default)>
//     <2=> PTE18<selection=PTE18_SIG_SEL,LCD_P57/ADC0_DP2/ADC0_SE2>
//     <1=> Default
#define LCD_P57_PIN_SEL      1
#if LCD_P57_PIN_SEL == 2
#define LCD_P57_GPIO         digitalIO_PTE18
#define LCD_P57_FN           0
#endif

// Pin Mapping for LCD_P57_fault signal
//   <o> LCD_P57_fault [PTE18]<name=LCD_P57_fault_PIN_SEL>
//   <i> Shows which pin LCD_P57_fault is mapped to
//     <0=> Disabled
//     <1=> PTE18<selection=PTE18_SIG_SEL,LCD_P57_fault>
//     <0=> Default
#define LCD_P57_fault_PIN_SEL 0
#if LCD_P57_fault_PIN_SEL == 1
#define LCD_P57_fault_GPIO   digitalIO_PTE18
#define LCD_P57_fault_FN     7
#endif

// Pin Mapping for LCD_P58 signal
//   <o> LCD_P58 [PTE19]<name=LCD_P58_PIN_SEL>
//   <i> Shows which pin LCD_P58 is mapped to
//     <0=> Disabled
//     <1=> PTE19 (reset default)<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a (reset default)>
//     <2=> PTE19<selection=PTE19_SIG_SEL,LCD_P58/ADC0_DM2/ADC0_SE6a>
//     <1=> Default
#define LCD_P58_PIN_SEL      1
#if LCD_P58_PIN_SEL == 2
#define LCD_P58_GPIO         digitalIO_PTE19
#define LCD_P58_FN           0
#endif

// Pin Mapping for LCD_P58_fault signal
//   <o> LCD_P58_fault [PTE19]<name=LCD_P58_fault_PIN_SEL>
//   <i> Shows which pin LCD_P58_fault is mapped to
//     <0=> Disabled
//     <1=> PTE19<selection=PTE19_SIG_SEL,LCD_P58_fault>
//     <0=> Default
#define LCD_P58_fault_PIN_SEL 0
#if LCD_P58_fault_PIN_SEL == 1
#define LCD_P58_fault_GPIO   digitalIO_PTE19
#define LCD_P58_fault_FN     7
#endif

// Pin Mapping for LCD_P59 signal
//   <o> LCD_P59 [PTE20]<name=LCD_P59_PIN_SEL>
//   <i> Shows which pin LCD_P59 is mapped to
//     <0=> Disabled
//     <1=> PTE20 (reset default)<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0 (reset default)>
//     <2=> PTE20<selection=PTE20_SIG_SEL,LCD_P59/ADC0_DP0/ADC0_SE0>
//     <1=> Default
#define LCD_P59_PIN_SEL      1
#if LCD_P59_PIN_SEL == 2
#define LCD_P59_GPIO         digitalIO_PTE20
#define LCD_P59_FN           0
#endif

// Pin Mapping for LCD_P59_fault signal
//   <o> LCD_P59_fault [PTE20]<name=LCD_P59_fault_PIN_SEL>
//   <i> Shows which pin LCD_P59_fault is mapped to
//     <0=> Disabled
//     <1=> PTE20<selection=PTE20_SIG_SEL,LCD_P59_fault>
//     <0=> Default
#define LCD_P59_fault_PIN_SEL 0
#if LCD_P59_fault_PIN_SEL == 1
#define LCD_P59_fault_GPIO   digitalIO_PTE20
#define LCD_P59_fault_FN     7
#endif

// Pin Mapping for LCD_P60 signal
//   <o> LCD_P60 [PTE21]<name=LCD_P60_PIN_SEL>
//   <i> Shows which pin LCD_P60 is mapped to
//     <0=> Disabled
//     <1=> PTE21 (reset default)<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a (reset default)>
//     <2=> PTE21<selection=PTE21_SIG_SEL,LCD_P60/ADC0_DM0/ADC0_SE4a>
//     <1=> Default
#define LCD_P60_PIN_SEL      1
#if LCD_P60_PIN_SEL == 2
#define LCD_P60_GPIO         digitalIO_PTE21
#define LCD_P60_FN           0
#endif

