podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// <h> Serial Peripheral Interface (SPI0)

// Pin Mapping for SPI0_MISO signal
//   <o> SPI0_MISO [PTA17, PTC7, PTD3, PTE19, PTA16, PTC6, PTD2, PTE18]<name=SPI0_MISO_PIN_SEL>
//   <i> Shows which pin SPI0_MISO is mapped to
//     <0=> Disabled
//     <1=> PTA17<selection=PTA17_SIG_SEL,SPI0_MISO>
//     <2=> PTC7<selection=PTC7_SIG_SEL,SPI0_MISO>
//     <3=> PTD3<selection=PTD3_SIG_SEL,SPI0_MISO>
//     <4=> PTE19<selection=PTE19_SIG_SEL,SPI0_MISO>
//     <5=> PTA16<selection=PTA16_SIG_SEL,SPI0_MISO>
//     <6=> PTC6<selection=PTC6_SIG_SEL,SPI0_MISO>
//     <7=> PTD2<selection=PTD2_SIG_SEL,SPI0_MISO>
//     <8=> PTE18<selection=PTE18_SIG_SEL,SPI0_MISO>
//     <0=> Default
#define SPI0_MISO_PIN_SEL    0
#if SPI0_MISO_PIN_SEL == 1
#define SPI0_MISO_GPIO       digitalIO_PTA17
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 2
#define SPI0_MISO_GPIO       digitalIO_PTC7
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 3
#define SPI0_MISO_GPIO       digitalIO_PTD3
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 4
#define SPI0_MISO_GPIO       digitalIO_PTE19
#define SPI0_MISO_FN         2
#elif SPI0_MISO_PIN_SEL == 5
#define SPI0_MISO_GPIO       digitalIO_PTA16
#define SPI0_MISO_FN         5
#elif SPI0_MISO_PIN_SEL == 6
#define SPI0_MISO_GPIO       digitalIO_PTC6
#define SPI0_MISO_FN         5
#elif SPI0_MISO_PIN_SEL == 7
#define SPI0_MISO_GPIO       digitalIO_PTD2
#define SPI0_MISO_FN         5
#elif SPI0_MISO_PIN_SEL == 8
#define SPI0_MISO_GPIO       digitalIO_PTE18
#define SPI0_MISO_FN         5
#endif

// Pin Mapping for SPI0_MOSI signal
//   <o> SPI0_MOSI [PTA16, PTC6, PTD2, PTE18, PTA17, PTC7, PTD3, PTE19]<name=SPI0_MOSI_PIN_SEL>
//   <i> Shows which pin SPI0_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTA16<selection=PTA16_SIG_SEL,SPI0_MOSI>
//     <2=> PTC6<selection=PTC6_SIG_SEL,SPI0_MOSI>
//     <3=> PTD2<selection=PTD2_SIG_SEL,SPI0_MOSI>
//     <4=> PTE18<selection=PTE18_SIG_SEL,SPI0_MOSI>
//     <5=> PTA17<selection=PTA17_SIG_SEL,SPI0_MOSI>
//     <6=> PTC7<selection=PTC7_SIG_SEL,SPI0_MOSI>
//     <7=> PTD3<selection=PTD3_SIG_SEL,SPI0_MOSI>
//     <8=> PTE19<selection=PTE19_SIG_SEL,SPI0_MOSI>
//     <0=> Default
#define SPI0_MOSI_PIN_SEL    0
#if SPI0_MOSI_PIN_SEL == 1
#define SPI0_MOSI_GPIO       digitalIO_PTA16
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 2
#define SPI0_MOSI_GPIO       digitalIO_PTC6
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 3
#define SPI0_MOSI_GPIO       digitalIO_PTD2
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 4
#define SPI0_MOSI_GPIO       digitalIO_PTE18
#define SPI0_MOSI_FN         2
#elif SPI0_MOSI_PIN_SEL == 5
#define SPI0_MOSI_GPIO       digitalIO_PTA17
#define SPI0_MOSI_FN         5
#elif SPI0_MOSI_PIN_SEL == 6
#define SPI0_MOSI_GPIO       digitalIO_PTC7
#define SPI0_MOSI_FN         5
#elif SPI0_MOSI_PIN_SEL == 7
#define SPI0_MOSI_GPIO       digitalIO_PTD3
#define SPI0_MOSI_FN         5
#elif SPI0_MOSI_PIN_SEL == 8
#define SPI0_MOSI_GPIO       digitalIO_PTE19
#define SPI0_MOSI_FN         5
#endif

// Pin Mapping for SPI0_PCS0 signal
//   <o> SPI0_PCS0 [PTA14, PTC4, PTD0, PTE16]<name=SPI0_PCS0_PIN_SEL>
//   <i> Shows which pin SPI0_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTA14<selection=PTA14_SIG_SEL,SPI0_PCS0>
//     <2=> PTC4<selection=PTC4_SIG_SEL,SPI0_PCS0>
//     <3=> PTD0<selection=PTD0_SIG_SEL,SPI0_PCS0>
//     <4=> PTE16<selection=PTE16_SIG_SEL,SPI0_PCS0>
//     <0=> Default
#define SPI0_PCS0_PIN_SEL    0
#if SPI0_PCS0_PIN_SEL == 1
#define SPI0_PCS0_GPIO       digitalIO_PTA14
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 2
#define SPI0_PCS0_GPIO       digitalIO_PTC4
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 3
#define SPI0_PCS0_GPIO       digitalIO_PTD0
#define SPI0_PCS0_FN         2
#elif SPI0_PCS0_PIN_SEL == 4
#define SPI0_PCS0_GPIO       digitalIO_PTE16
#define SPI0_PCS0_FN         2
#endif

// Pin Mapping for SPI0_SCK signal
//   <o> SPI0_SCK [PTA15, PTC5, PTD1, PTE17]<name=SPI0_SCK_PIN_SEL>
//   <i> Shows which pin SPI0_SCK is mapped to
//     <0=> Disabled
//     <1=> PTA15<selection=PTA15_SIG_SEL,SPI0_SCK>
//     <2=> PTC5<selection=PTC5_SIG_SEL,SPI0_SCK>
//     <3=> PTD1<selection=PTD1_SIG_SEL,SPI0_SCK>
//     <4=> PTE17<selection=PTE17_SIG_SEL,SPI0_SCK>
//     <0=> Default
#define SPI0_SCK_PIN_SEL     0
#if SPI0_SCK_PIN_SEL == 1
#define SPI0_SCK_GPIO        digitalIO_PTA15
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 2
#define SPI0_SCK_GPIO        digitalIO_PTC5
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 3
#define SPI0_SCK_GPIO        digitalIO_PTD1
#define SPI0_SCK_FN          2
#elif SPI0_SCK_PIN_SEL == 4
#define SPI0_SCK_GPIO        digitalIO_PTE17
#define SPI0_SCK_FN          2
#endif

// </h>

// <h> Serial Peripheral Interface (SPI1)

// Pin Mapping for SPI1_MISO signal
//   <o> SPI1_MISO [PTB17, PTD7, PTE0, PTE3, PTB16, PTD6, PTE1]<name=SPI1_MISO_PIN_SEL>
//   <i> Shows which pin SPI1_MISO is mapped to
//     <0=> Disabled
//     <1=> PTB17<selection=PTB17_SIG_SEL,SPI1_MISO>
//     <2=> PTD7<selection=PTD7_SIG_SEL,SPI1_MISO>
//     <3=> PTE0<selection=PTE0_SIG_SEL,SPI1_MISO>
//     <4=> PTE3<selection=PTE3_SIG_SEL,SPI1_MISO>
//     <5=> PTB16<selection=PTB16_SIG_SEL,SPI1_MISO>
//     <6=> PTD6<selection=PTD6_SIG_SEL,SPI1_MISO>
//     <7=> PTE1<selection=PTE1_SIG_SEL,SPI1_MISO>
//     <0=> Default
#define SPI1_MISO_PIN_SEL    0
#if SPI1_MISO_PIN_SEL == 1
#define SPI1_MISO_GPIO       digitalIO_PTB17
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 2
#define SPI1_MISO_GPIO       digitalIO_PTD7
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 3
#define SPI1_MISO_GPIO       digitalIO_PTE0
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 4
#define SPI1_MISO_GPIO       digitalIO_PTE3
#define SPI1_MISO_FN         2
#elif SPI1_MISO_PIN_SEL == 5
#define SPI1_MISO_GPIO       digitalIO_PTB16
#define SPI1_MISO_FN         5
#elif SPI1_MISO_PIN_SEL == 6
#define SPI1_MISO_GPIO       digitalIO_PTD6
#define SPI1_MISO_FN         5
#elif SPI1_MISO_PIN_SEL == 7
#define SPI1_MISO_GPIO       digitalIO_PTE1
#define SPI1_MISO_FN         5
#endif

