podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for SPI1_MOSI signal
//   <o> SPI1_MOSI [PTB16, PTD6, PTE1, PTB17, PTD7, PTE3]<name=SPI1_MOSI_PIN_SEL>
//   <i> Shows which pin SPI1_MOSI is mapped to
//     <0=> Disabled
//     <1=> PTB16<selection=PTB16_SIG_SEL,SPI1_MOSI>
//     <2=> PTD6<selection=PTD6_SIG_SEL,SPI1_MOSI>
//     <3=> PTE1<selection=PTE1_SIG_SEL,SPI1_MOSI>
//     <4=> PTB17<selection=PTB17_SIG_SEL,SPI1_MOSI>
//     <5=> PTD7<selection=PTD7_SIG_SEL,SPI1_MOSI>
//     <6=> PTE3<selection=PTE3_SIG_SEL,SPI1_MOSI>
//     <0=> Default
#define SPI1_MOSI_PIN_SEL    0
#if SPI1_MOSI_PIN_SEL == 1
#define SPI1_MOSI_GPIO       digitalIO_PTB16
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 2
#define SPI1_MOSI_GPIO       digitalIO_PTD6
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 3
#define SPI1_MOSI_GPIO       digitalIO_PTE1
#define SPI1_MOSI_FN         2
#elif SPI1_MOSI_PIN_SEL == 4
#define SPI1_MOSI_GPIO       digitalIO_PTB17
#define SPI1_MOSI_FN         5
#elif SPI1_MOSI_PIN_SEL == 5
#define SPI1_MOSI_GPIO       digitalIO_PTD7
#define SPI1_MOSI_FN         5
#elif SPI1_MOSI_PIN_SEL == 6
#define SPI1_MOSI_GPIO       digitalIO_PTE3
#define SPI1_MOSI_FN         5
#endif

// Pin Mapping for SPI1_PCS0 signal
//   <o> SPI1_PCS0 [PTB8, PTB10, PTD4, PTE4]<name=SPI1_PCS0_PIN_SEL>
//   <i> Shows which pin SPI1_PCS0 is mapped to
//     <0=> Disabled
//     <1=> PTB8<selection=PTB8_SIG_SEL,SPI1_PCS0>
//     <2=> PTB10<selection=PTB10_SIG_SEL,SPI1_PCS0>
//     <3=> PTD4<selection=PTD4_SIG_SEL,SPI1_PCS0>
//     <4=> PTE4<selection=PTE4_SIG_SEL,SPI1_PCS0>
//     <0=> Default
#define SPI1_PCS0_PIN_SEL    0
#if SPI1_PCS0_PIN_SEL == 1
#define SPI1_PCS0_GPIO       digitalIO_PTB8
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 2
#define SPI1_PCS0_GPIO       digitalIO_PTB10
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 3
#define SPI1_PCS0_GPIO       digitalIO_PTD4
#define SPI1_PCS0_FN         2
#elif SPI1_PCS0_PIN_SEL == 4
#define SPI1_PCS0_GPIO       digitalIO_PTE4
#define SPI1_PCS0_FN         2
#endif

// Pin Mapping for SPI1_SCK signal
//   <o> SPI1_SCK [PTB9, PTB11, PTD5, PTE2]<name=SPI1_SCK_PIN_SEL>
//   <i> Shows which pin SPI1_SCK is mapped to
//     <0=> Disabled
//     <1=> PTB9<selection=PTB9_SIG_SEL,SPI1_SCK>
//     <2=> PTB11<selection=PTB11_SIG_SEL,SPI1_SCK>
//     <3=> PTD5<selection=PTD5_SIG_SEL,SPI1_SCK>
//     <4=> PTE2<selection=PTE2_SIG_SEL,SPI1_SCK>
//     <0=> Default
#define SPI1_SCK_PIN_SEL     0
#if SPI1_SCK_PIN_SEL == 1
#define SPI1_SCK_GPIO        digitalIO_PTB9
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 2
#define SPI1_SCK_GPIO        digitalIO_PTB11
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 3
#define SPI1_SCK_GPIO        digitalIO_PTD5
#define SPI1_SCK_FN          2
#elif SPI1_SCK_PIN_SEL == 4
#define SPI1_SCK_GPIO        digitalIO_PTE2
#define SPI1_SCK_FN          2
#endif

// </h>

// <h> Timer (TPM0)

// Pin Mapping for TPM0_CH0 signal
//   <o> TPM0_CH0 [PTA3, PTE24, PTC1, PTD0]<name=TPM0_CH0_PIN_SEL>
//   <i> Shows which pin TPM0_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,TPM0_CH0>
//     <2=> PTE24<selection=PTE24_SIG_SEL,TPM0_CH0>
//     <3=> PTC1<selection=PTC1_SIG_SEL,TPM0_CH0>
//     <4=> PTD0<selection=PTD0_SIG_SEL,TPM0_CH0>
//     <0=> Default
#define TPM0_CH0_PIN_SEL     0
#if TPM0_CH0_PIN_SEL == 1
#define TPM0_CH0_GPIO        digitalIO_PTA3
#define TPM0_CH0_FN          3
#elif TPM0_CH0_PIN_SEL == 2
#define TPM0_CH0_GPIO        digitalIO_PTE24
#define TPM0_CH0_FN          3
#elif TPM0_CH0_PIN_SEL == 3
#define TPM0_CH0_GPIO        digitalIO_PTC1
#define TPM0_CH0_FN          4
#elif TPM0_CH0_PIN_SEL == 4
#define TPM0_CH0_GPIO        digitalIO_PTD0
#define TPM0_CH0_FN          4
#endif

// Pin Mapping for TPM0_CH1 signal
//   <o> TPM0_CH1 [PTA4, PTE25, PTC2, PTD1]<name=TPM0_CH1_PIN_SEL>
//   <i> Shows which pin TPM0_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,TPM0_CH1>
//     <2=> PTE25<selection=PTE25_SIG_SEL,TPM0_CH1>
//     <3=> PTC2<selection=PTC2_SIG_SEL,TPM0_CH1>
//     <4=> PTD1<selection=PTD1_SIG_SEL,TPM0_CH1>
//     <4=> Default
#define TPM0_CH1_PIN_SEL     4
#if TPM0_CH1_PIN_SEL == 1
#define TPM0_CH1_GPIO        digitalIO_PTA4
#define TPM0_CH1_FN          3
#elif TPM0_CH1_PIN_SEL == 2
#define TPM0_CH1_GPIO        digitalIO_PTE25
#define TPM0_CH1_FN          3
#elif TPM0_CH1_PIN_SEL == 3
#define TPM0_CH1_GPIO        digitalIO_PTC2
#define TPM0_CH1_FN          4
#elif TPM0_CH1_PIN_SEL == 4
#define TPM0_CH1_GPIO        digitalIO_PTD1
#define TPM0_CH1_FN          4
#endif

// Pin Mapping for TPM0_CH2 signal
//   <o> TPM0_CH2 [PTA5, PTE29, PTC3, PTD2]<name=TPM0_CH2_PIN_SEL>
//   <i> Shows which pin TPM0_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,TPM0_CH2>
//     <2=> PTE29<selection=PTE29_SIG_SEL,TPM0_CH2>
//     <3=> PTC3<selection=PTC3_SIG_SEL,TPM0_CH2>
//     <4=> PTD2<selection=PTD2_SIG_SEL,TPM0_CH2>
//     <2=> Default
#define TPM0_CH2_PIN_SEL     2
#if TPM0_CH2_PIN_SEL == 1
#define TPM0_CH2_GPIO        digitalIO_PTA5
#define TPM0_CH2_FN          3
#elif TPM0_CH2_PIN_SEL == 2
#define TPM0_CH2_GPIO        digitalIO_PTE29
#define TPM0_CH2_FN          3
#elif TPM0_CH2_PIN_SEL == 3
#define TPM0_CH2_GPIO        digitalIO_PTC3
#define TPM0_CH2_FN          4
#elif TPM0_CH2_PIN_SEL == 4
#define TPM0_CH2_GPIO        digitalIO_PTD2
#define TPM0_CH2_FN          4
#endif

// Pin Mapping for TPM0_CH3 signal
//   <o> TPM0_CH3 [PTA6, PTE30, PTC4, PTD3]<name=TPM0_CH3_PIN_SEL>
//   <i> Shows which pin TPM0_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTA6<selection=PTA6_SIG_SEL,TPM0_CH3>
//     <2=> PTE30<selection=PTE30_SIG_SEL,TPM0_CH3>
//     <3=> PTC4<selection=PTC4_SIG_SEL,TPM0_CH3>
//     <4=> PTD3<selection=PTD3_SIG_SEL,TPM0_CH3>
//     <0=> Default
#define TPM0_CH3_PIN_SEL     0
#if TPM0_CH3_PIN_SEL == 1
#define TPM0_CH3_GPIO        digitalIO_PTA6
#define TPM0_CH3_FN          3
#elif TPM0_CH3_PIN_SEL == 2
#define TPM0_CH3_GPIO        digitalIO_PTE30
#define TPM0_CH3_FN          3
#elif TPM0_CH3_PIN_SEL == 3
#define TPM0_CH3_GPIO        digitalIO_PTC4
#define TPM0_CH3_FN          4
#elif TPM0_CH3_PIN_SEL == 4
#define TPM0_CH3_GPIO        digitalIO_PTD3
#define TPM0_CH3_FN          4
#endif

// Pin Mapping for TPM0_CH4 signal
//   <o> TPM0_CH4 [PTA7, PTC8, PTE31, PTD4]<name=TPM0_CH4_PIN_SEL>
//   <i> Shows which pin TPM0_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTA7<selection=PTA7_SIG_SEL,TPM0_CH4>
//     <2=> PTC8<selection=PTC8_SIG_SEL,TPM0_CH4>
//     <3=> PTE31<selection=PTE31_SIG_SEL,TPM0_CH4>
//     <4=> PTD4<selection=PTD4_SIG_SEL,TPM0_CH4>
//     <0=> Default
#define TPM0_CH4_PIN_SEL     0
#if TPM0_CH4_PIN_SEL == 1
#define TPM0_CH4_GPIO        digitalIO_PTA7
#define TPM0_CH4_FN          3
#elif TPM0_CH4_PIN_SEL == 2
#define TPM0_CH4_GPIO        digitalIO_PTC8
#define TPM0_CH4_FN          3
#elif TPM0_CH4_PIN_SEL == 3
#define TPM0_CH4_GPIO        digitalIO_PTE31
#define TPM0_CH4_FN          3
#elif TPM0_CH4_PIN_SEL == 4
#define TPM0_CH4_GPIO        digitalIO_PTD4
#define TPM0_CH4_FN          4
#endif

