podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for TPM0_CH5 signal
//   <o> TPM0_CH5 [PTA0, PTC9, PTE26, PTD5]<name=TPM0_CH5_PIN_SEL>
//   <i> Shows which pin TPM0_CH5 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,TPM0_CH5>
//     <2=> PTC9<selection=PTC9_SIG_SEL,TPM0_CH5>
//     <3=> PTE26<selection=PTE26_SIG_SEL,TPM0_CH5>
//     <4=> PTD5<selection=PTD5_SIG_SEL,TPM0_CH5>
//     <4=> Default
#define TPM0_CH5_PIN_SEL     4
#if TPM0_CH5_PIN_SEL == 1
#define TPM0_CH5_GPIO        digitalIO_PTA0
#define TPM0_CH5_FN          3
#elif TPM0_CH5_PIN_SEL == 2
#define TPM0_CH5_GPIO        digitalIO_PTC9
#define TPM0_CH5_FN          3
#elif TPM0_CH5_PIN_SEL == 3
#define TPM0_CH5_GPIO        digitalIO_PTE26
#define TPM0_CH5_FN          3
#elif TPM0_CH5_PIN_SEL == 4
#define TPM0_CH5_GPIO        digitalIO_PTD5
#define TPM0_CH5_FN          4
#endif

// </h>

// <h> Timer (TPM1)

// Pin Mapping for TPM1_CH0 signal
//   <o> TPM1_CH0 [PTA12, PTB0, PTE20]<name=TPM1_CH0_PIN_SEL>
//   <i> Shows which pin TPM1_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA12<selection=PTA12_SIG_SEL,TPM1_CH0>
//     <2=> PTB0<selection=PTB0_SIG_SEL,TPM1_CH0>
//     <3=> PTE20<selection=PTE20_SIG_SEL,TPM1_CH0>
//     <0=> Default
#define TPM1_CH0_PIN_SEL     0
#if TPM1_CH0_PIN_SEL == 1
#define TPM1_CH0_GPIO        digitalIO_PTA12
#define TPM1_CH0_FN          3
#elif TPM1_CH0_PIN_SEL == 2
#define TPM1_CH0_GPIO        digitalIO_PTB0
#define TPM1_CH0_FN          3
#elif TPM1_CH0_PIN_SEL == 3
#define TPM1_CH0_GPIO        digitalIO_PTE20
#define TPM1_CH0_FN          3
#endif

// Pin Mapping for TPM1_CH1 signal
//   <o> TPM1_CH1 [PTA13, PTB1, PTE21]<name=TPM1_CH1_PIN_SEL>
//   <i> Shows which pin TPM1_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA13<selection=PTA13_SIG_SEL,TPM1_CH1>
//     <2=> PTB1<selection=PTB1_SIG_SEL,TPM1_CH1>
//     <3=> PTE21<selection=PTE21_SIG_SEL,TPM1_CH1>
//     <0=> Default
#define TPM1_CH1_PIN_SEL     0
#if TPM1_CH1_PIN_SEL == 1
#define TPM1_CH1_GPIO        digitalIO_PTA13
#define TPM1_CH1_FN          3
#elif TPM1_CH1_PIN_SEL == 2
#define TPM1_CH1_GPIO        digitalIO_PTB1
#define TPM1_CH1_FN          3
#elif TPM1_CH1_PIN_SEL == 3
#define TPM1_CH1_GPIO        digitalIO_PTE21
#define TPM1_CH1_FN          3
#endif

// </h>

// <h> Timer (TPM2)

// Pin Mapping for TPM2_CH0 signal
//   <o> TPM2_CH0 [PTA1, PTB2, PTB18, PTE22]<name=TPM2_CH0_PIN_SEL>
//   <i> Shows which pin TPM2_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,TPM2_CH0>
//     <2=> PTB2<selection=PTB2_SIG_SEL,TPM2_CH0>
//     <3=> PTB18<selection=PTB18_SIG_SEL,TPM2_CH0>
//     <4=> PTE22<selection=PTE22_SIG_SEL,TPM2_CH0>
//     <0=> Default
#define TPM2_CH0_PIN_SEL     0
#if TPM2_CH0_PIN_SEL == 1
#define TPM2_CH0_GPIO        digitalIO_PTA1
#define TPM2_CH0_FN          3
#elif TPM2_CH0_PIN_SEL == 2
#define TPM2_CH0_GPIO        digitalIO_PTB2
#define TPM2_CH0_FN          3
#elif TPM2_CH0_PIN_SEL == 3
#define TPM2_CH0_GPIO        digitalIO_PTB18
#define TPM2_CH0_FN          3
#elif TPM2_CH0_PIN_SEL == 4
#define TPM2_CH0_GPIO        digitalIO_PTE22
#define TPM2_CH0_FN          3
#endif

// Pin Mapping for TPM2_CH1 signal
//   <o> TPM2_CH1 [PTA2, PTB3, PTB19, PTE23]<name=TPM2_CH1_PIN_SEL>
//   <i> Shows which pin TPM2_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,TPM2_CH1>
//     <2=> PTB3<selection=PTB3_SIG_SEL,TPM2_CH1>
//     <3=> PTB19<selection=PTB19_SIG_SEL,TPM2_CH1>
//     <4=> PTE23<selection=PTE23_SIG_SEL,TPM2_CH1>
//     <0=> Default
#define TPM2_CH1_PIN_SEL     0
#if TPM2_CH1_PIN_SEL == 1
#define TPM2_CH1_GPIO        digitalIO_PTA2
#define TPM2_CH1_FN          3
#elif TPM2_CH1_PIN_SEL == 2
#define TPM2_CH1_GPIO        digitalIO_PTB3
#define TPM2_CH1_FN          3
#elif TPM2_CH1_PIN_SEL == 3
#define TPM2_CH1_GPIO        digitalIO_PTB19
#define TPM2_CH1_FN          3
#elif TPM2_CH1_PIN_SEL == 4
#define TPM2_CH1_GPIO        digitalIO_PTE23
#define TPM2_CH1_FN          3
#endif

// </h>

// <h> Touch Sense Interface (TSI0)

// Pin Mapping for TSI0_CH0 signal
//   <o> TSI0_CH0 [PTB0]<name=TSI0_CH0_PIN_SEL>
//   <i> Shows which pin TSI0_CH0 is mapped to
//     <0=> Disabled
//     <1=> PTB0 (reset default)<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0 (reset default)>
//     <2=> PTB0<selection=PTB0_SIG_SEL,LCD_P0/ADC0_SE8/TSI0_CH0>
//     <2=> Default
#define TSI0_CH0_PIN_SEL     2
#if TSI0_CH0_PIN_SEL == 2
#define TSI0_CH0_GPIO        digitalIO_PTB0
#define TSI0_CH0_FN          0
#endif

// Pin Mapping for TSI0_CH1 signal
//   <o> TSI0_CH1 [PTA0]<name=TSI0_CH1_PIN_SEL>
//   <i> Shows which pin TSI0_CH1 is mapped to
//     <0=> Disabled
//     <1=> PTA0<selection=PTA0_SIG_SEL,TSI0_CH1>
//     <0=> Default
#define TSI0_CH1_PIN_SEL     0
#if TSI0_CH1_PIN_SEL == 1
#define TSI0_CH1_GPIO        digitalIO_PTA0
#define TSI0_CH1_FN          0
#endif

// Pin Mapping for TSI0_CH2 signal
//   <o> TSI0_CH2 [PTA1]<name=TSI0_CH2_PIN_SEL>
//   <i> Shows which pin TSI0_CH2 is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,TSI0_CH2>
//     <0=> Default
#define TSI0_CH2_PIN_SEL     0
#if TSI0_CH2_PIN_SEL == 1
#define TSI0_CH2_GPIO        digitalIO_PTA1
#define TSI0_CH2_FN          0
#endif

// Pin Mapping for TSI0_CH3 signal
//   <o> TSI0_CH3 [PTA2]<name=TSI0_CH3_PIN_SEL>
//   <i> Shows which pin TSI0_CH3 is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,TSI0_CH3>
//     <0=> Default
#define TSI0_CH3_PIN_SEL     0
#if TSI0_CH3_PIN_SEL == 1
#define TSI0_CH3_GPIO        digitalIO_PTA2
#define TSI0_CH3_FN          0
#endif

// Pin Mapping for TSI0_CH4 signal
//   <o> TSI0_CH4 [PTA3]<name=TSI0_CH4_PIN_SEL>
//   <i> Shows which pin TSI0_CH4 is mapped to
//     <0=> Disabled
//     <1=> PTA3<selection=PTA3_SIG_SEL,TSI0_CH4>
//     <0=> Default
#define TSI0_CH4_PIN_SEL     0
#if TSI0_CH4_PIN_SEL == 1
#define TSI0_CH4_GPIO        digitalIO_PTA3
#define TSI0_CH4_FN          0
#endif

// Pin Mapping for TSI0_CH5 signal
//   <o> TSI0_CH5 [PTA4]<name=TSI0_CH5_PIN_SEL>
//   <i> Shows which pin TSI0_CH5 is mapped to
//     <0=> Disabled
//     <1=> PTA4<selection=PTA4_SIG_SEL,TSI0_CH5>
//     <0=> Default
#define TSI0_CH5_PIN_SEL     0
#if TSI0_CH5_PIN_SEL == 1
#define TSI0_CH5_GPIO        digitalIO_PTA4
#define TSI0_CH5_FN          0
#endif

// Pin Mapping for TSI0_CH6 signal
//   <o> TSI0_CH6 [PTB1]<name=TSI0_CH6_PIN_SEL>
//   <i> Shows which pin TSI0_CH6 is mapped to
//     <0=> Disabled
//     <1=> PTB1 (reset default)<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6 (reset default)>
//     <2=> PTB1<selection=PTB1_SIG_SEL,LCD_P1/ADC0_SE9/TSI0_CH6>
//     <2=> Default
#define TSI0_CH6_PIN_SEL     2
#if TSI0_CH6_PIN_SEL == 2
#define TSI0_CH6_GPIO        digitalIO_PTB1
#define TSI0_CH6_FN          0
#endif

