podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// Pin Mapping for TSI0_CH7 signal
//   <o> TSI0_CH7 [PTB2]<name=TSI0_CH7_PIN_SEL>
//   <i> Shows which pin TSI0_CH7 is mapped to
//     <0=> Disabled
//     <1=> PTB2 (reset default)<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7 (reset default)>
//     <2=> PTB2<selection=PTB2_SIG_SEL,LCD_P2/ADC0_SE12/TSI0_CH7>
//     <2=> Default
#define TSI0_CH7_PIN_SEL     2
#if TSI0_CH7_PIN_SEL == 2
#define TSI0_CH7_GPIO        digitalIO_PTB2
#define TSI0_CH7_FN          0
#endif

// Pin Mapping for TSI0_CH8 signal
//   <o> TSI0_CH8 [PTB3]<name=TSI0_CH8_PIN_SEL>
//   <i> Shows which pin TSI0_CH8 is mapped to
//     <0=> Disabled
//     <1=> PTB3 (reset default)<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8 (reset default)>
//     <2=> PTB3<selection=PTB3_SIG_SEL,LCD_P3/ADC0_SE13/TSI0_CH8>
//     <2=> Default
#define TSI0_CH8_PIN_SEL     2
#if TSI0_CH8_PIN_SEL == 2
#define TSI0_CH8_GPIO        digitalIO_PTB3
#define TSI0_CH8_FN          0
#endif

// Pin Mapping for TSI0_CH9 signal
//   <o> TSI0_CH9 [PTB16]<name=TSI0_CH9_PIN_SEL>
//   <i> Shows which pin TSI0_CH9 is mapped to
//     <0=> Disabled
//     <1=> PTB16 (reset default)<selection=PTB16_SIG_SEL,LCD_P12/TSI0_CH9 (reset default)>
//     <2=> PTB16<selection=PTB16_SIG_SEL,LCD_P12/TSI0_CH9>
//     <1=> Default
#define TSI0_CH9_PIN_SEL     1
#if TSI0_CH9_PIN_SEL == 2
#define TSI0_CH9_GPIO        digitalIO_PTB16
#define TSI0_CH9_FN          0
#endif

// Pin Mapping for TSI0_CH10 signal
//   <o> TSI0_CH10 [PTB17]<name=TSI0_CH10_PIN_SEL>
//   <i> Shows which pin TSI0_CH10 is mapped to
//     <0=> Disabled
//     <1=> PTB17 (reset default)<selection=PTB17_SIG_SEL,LCD_P13/TSI0_CH10 (reset default)>
//     <2=> PTB17<selection=PTB17_SIG_SEL,LCD_P13/TSI0_CH10>
//     <1=> Default
#define TSI0_CH10_PIN_SEL    1
#if TSI0_CH10_PIN_SEL == 2
#define TSI0_CH10_GPIO       digitalIO_PTB17
#define TSI0_CH10_FN         0
#endif

// Pin Mapping for TSI0_CH11 signal
//   <o> TSI0_CH11 [PTB18]<name=TSI0_CH11_PIN_SEL>
//   <i> Shows which pin TSI0_CH11 is mapped to
//     <0=> Disabled
//     <1=> PTB18 (reset default)<selection=PTB18_SIG_SEL,LCD_P14/TSI0_CH11 (reset default)>
//     <2=> PTB18<selection=PTB18_SIG_SEL,LCD_P14/TSI0_CH11>
//     <1=> Default
#define TSI0_CH11_PIN_SEL    1
#if TSI0_CH11_PIN_SEL == 2
#define TSI0_CH11_GPIO       digitalIO_PTB18
#define TSI0_CH11_FN         0
#endif

// Pin Mapping for TSI0_CH12 signal
//   <o> TSI0_CH12 [PTB19]<name=TSI0_CH12_PIN_SEL>
//   <i> Shows which pin TSI0_CH12 is mapped to
//     <0=> Disabled
//     <1=> PTB19 (reset default)<selection=PTB19_SIG_SEL,LCD_P15/TSI0_CH12 (reset default)>
//     <2=> PTB19<selection=PTB19_SIG_SEL,LCD_P15/TSI0_CH12>
//     <1=> Default
#define TSI0_CH12_PIN_SEL    1
#if TSI0_CH12_PIN_SEL == 2
#define TSI0_CH12_GPIO       digitalIO_PTB19
#define TSI0_CH12_FN         0
#endif

// Pin Mapping for TSI0_CH13 signal
//   <o> TSI0_CH13 [PTC0]<name=TSI0_CH13_PIN_SEL>
//   <i> Shows which pin TSI0_CH13 is mapped to
//     <0=> Disabled
//     <1=> PTC0 (reset default)<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13 (reset default)>
//     <2=> PTC0<selection=PTC0_SIG_SEL,LCD_P20/ADC0_SE14/TSI0_CH13>
//     <1=> Default
#define TSI0_CH13_PIN_SEL    1
#if TSI0_CH13_PIN_SEL == 2
#define TSI0_CH13_GPIO       digitalIO_PTC0
#define TSI0_CH13_FN         0
#endif

// Pin Mapping for TSI0_CH14 signal
//   <o> TSI0_CH14 [PTC1]<name=TSI0_CH14_PIN_SEL>
//   <i> Shows which pin TSI0_CH14 is mapped to
//     <0=> Disabled
//     <1=> PTC1 (reset default)<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14 (reset default)>
//     <2=> PTC1<selection=PTC1_SIG_SEL,LCD_P21/ADC0_SE15/TSI0_CH14>
//     <2=> Default
#define TSI0_CH14_PIN_SEL    2
#if TSI0_CH14_PIN_SEL == 2
#define TSI0_CH14_GPIO       digitalIO_PTC1
#define TSI0_CH14_FN         0
#endif

// Pin Mapping for TSI0_CH15 signal
//   <o> TSI0_CH15 [PTC2]<name=TSI0_CH15_PIN_SEL>
//   <i> Shows which pin TSI0_CH15 is mapped to
//     <0=> Disabled
//     <1=> PTC2 (reset default)<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15 (reset default)>
//     <2=> PTC2<selection=PTC2_SIG_SEL,LCD_P22/ADC0_SE11/TSI0_CH15>
//     <2=> Default
#define TSI0_CH15_PIN_SEL    2
#if TSI0_CH15_PIN_SEL == 2
#define TSI0_CH15_GPIO       digitalIO_PTC2
#define TSI0_CH15_FN         0
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART0)

// Pin Mapping for UART0_RX signal
//   <o> UART0_RX [PTA1, PTA15, PTB16, PTD6, PTE21]<name=UART0_RX_PIN_SEL>
//   <i> Shows which pin UART0_RX is mapped to
//     <0=> Disabled
//     <1=> PTA1<selection=PTA1_SIG_SEL,UART0_RX>
//     <2=> PTA15<selection=PTA15_SIG_SEL,UART0_RX>
//     <3=> PTB16<selection=PTB16_SIG_SEL,UART0_RX>
//     <4=> PTD6<selection=PTD6_SIG_SEL,UART0_RX>
//     <5=> PTE21<selection=PTE21_SIG_SEL,UART0_RX>
//     <0=> Default
#define UART0_RX_PIN_SEL     0
#if UART0_RX_PIN_SEL == 1
#define UART0_RX_GPIO        digitalIO_PTA1
#define UART0_RX_FN          2
#elif UART0_RX_PIN_SEL == 2
#define UART0_RX_GPIO        digitalIO_PTA15
#define UART0_RX_FN          3
#elif UART0_RX_PIN_SEL == 3
#define UART0_RX_GPIO        digitalIO_PTB16
#define UART0_RX_FN          3
#elif UART0_RX_PIN_SEL == 4
#define UART0_RX_GPIO        digitalIO_PTD6
#define UART0_RX_FN          3
#elif UART0_RX_PIN_SEL == 5
#define UART0_RX_GPIO        digitalIO_PTE21
#define UART0_RX_FN          4
#endif

// Pin Mapping for UART0_TX signal
//   <o> UART0_TX [PTA2, PTA14, PTB17, PTD7, PTE20]<name=UART0_TX_PIN_SEL>
//   <i> Shows which pin UART0_TX is mapped to
//     <0=> Disabled
//     <1=> PTA2<selection=PTA2_SIG_SEL,UART0_TX>
//     <2=> PTA14<selection=PTA14_SIG_SEL,UART0_TX>
//     <3=> PTB17<selection=PTB17_SIG_SEL,UART0_TX>
//     <4=> PTD7<selection=PTD7_SIG_SEL,UART0_TX>
//     <5=> PTE20<selection=PTE20_SIG_SEL,UART0_TX>
//     <0=> Default
#define UART0_TX_PIN_SEL     0
#if UART0_TX_PIN_SEL == 1
#define UART0_TX_GPIO        digitalIO_PTA2
#define UART0_TX_FN          2
#elif UART0_TX_PIN_SEL == 2
#define UART0_TX_GPIO        digitalIO_PTA14
#define UART0_TX_FN          3
#elif UART0_TX_PIN_SEL == 3
#define UART0_TX_GPIO        digitalIO_PTB17
#define UART0_TX_FN          3
#elif UART0_TX_PIN_SEL == 4
#define UART0_TX_GPIO        digitalIO_PTD7
#define UART0_TX_FN          3
#elif UART0_TX_PIN_SEL == 5
#define UART0_TX_GPIO        digitalIO_PTE20
#define UART0_TX_FN          4
#endif

