podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/pin_mapping-MKL46Z4.h
// </h>

// <h> Universal Asynchronous Rx/Tx (UART1)

// Pin Mapping for UART1_RX signal
//   <o> UART1_RX [PTA18, PTC3, PTE1]<name=UART1_RX_PIN_SEL>
//   <i> Shows which pin UART1_RX is mapped to
//     <0=> Disabled
//     <1=> PTA18<selection=PTA18_SIG_SEL,UART1_RX>
//     <2=> PTC3<selection=PTC3_SIG_SEL,UART1_RX>
//     <3=> PTE1<selection=PTE1_SIG_SEL,UART1_RX>
//     <0=> Default
#define UART1_RX_PIN_SEL     0
#if UART1_RX_PIN_SEL == 1
#define UART1_RX_GPIO        digitalIO_PTA18
#define UART1_RX_FN          3
#elif UART1_RX_PIN_SEL == 2
#define UART1_RX_GPIO        digitalIO_PTC3
#define UART1_RX_FN          3
#elif UART1_RX_PIN_SEL == 3
#define UART1_RX_GPIO        digitalIO_PTE1
#define UART1_RX_FN          3
#endif

// Pin Mapping for UART1_TX signal
//   <o> UART1_TX [PTA19, PTC4, PTE0]<name=UART1_TX_PIN_SEL>
//   <i> Shows which pin UART1_TX is mapped to
//     <0=> Disabled
//     <1=> PTA19<selection=PTA19_SIG_SEL,UART1_TX>
//     <2=> PTC4<selection=PTC4_SIG_SEL,UART1_TX>
//     <3=> PTE0<selection=PTE0_SIG_SEL,UART1_TX>
//     <0=> Default
#define UART1_TX_PIN_SEL     0
#if UART1_TX_PIN_SEL == 1
#define UART1_TX_GPIO        digitalIO_PTA19
#define UART1_TX_FN          3
#elif UART1_TX_PIN_SEL == 2
#define UART1_TX_GPIO        digitalIO_PTC4
#define UART1_TX_FN          3
#elif UART1_TX_PIN_SEL == 3
#define UART1_TX_GPIO        digitalIO_PTE0
#define UART1_TX_FN          3
#endif

// </h>

// <h> Universal Asynchronous Rx/Tx (UART2)

// Pin Mapping for UART2_RX signal
//   <o> UART2_RX [PTD2, PTD4, PTE17, PTE23]<name=UART2_RX_PIN_SEL>
//   <i> Shows which pin UART2_RX is mapped to
//     <0=> Disabled
//     <1=> PTD2<selection=PTD2_SIG_SEL,UART2_RX>
//     <2=> PTD4<selection=PTD4_SIG_SEL,UART2_RX>
//     <3=> PTE17<selection=PTE17_SIG_SEL,UART2_RX>
//     <4=> PTE23<selection=PTE23_SIG_SEL,UART2_RX>
//     <0=> Default
#define UART2_RX_PIN_SEL     0
#if UART2_RX_PIN_SEL == 1
#define UART2_RX_GPIO        digitalIO_PTD2
#define UART2_RX_FN          3
#elif UART2_RX_PIN_SEL == 2
#define UART2_RX_GPIO        digitalIO_PTD4
#define UART2_RX_FN          3
#elif UART2_RX_PIN_SEL == 3
#define UART2_RX_GPIO        digitalIO_PTE17
#define UART2_RX_FN          3
#elif UART2_RX_PIN_SEL == 4
#define UART2_RX_GPIO        digitalIO_PTE23
#define UART2_RX_FN          4
#endif

// Pin Mapping for UART2_TX signal
//   <o> UART2_TX [PTD3, PTD5, PTE16, PTE22]<name=UART2_TX_PIN_SEL>
//   <i> Shows which pin UART2_TX is mapped to
//     <0=> Disabled
//     <1=> PTD3<selection=PTD3_SIG_SEL,UART2_TX>
//     <2=> PTD5<selection=PTD5_SIG_SEL,UART2_TX>
//     <3=> PTE16<selection=PTE16_SIG_SEL,UART2_TX>
//     <4=> PTE22<selection=PTE22_SIG_SEL,UART2_TX>
//     <0=> Default
#define UART2_TX_PIN_SEL     0
#if UART2_TX_PIN_SEL == 1
#define UART2_TX_GPIO        digitalIO_PTD3
#define UART2_TX_FN          3
#elif UART2_TX_PIN_SEL == 2
#define UART2_TX_GPIO        digitalIO_PTD5
#define UART2_TX_FN          3
#elif UART2_TX_PIN_SEL == 3
#define UART2_TX_GPIO        digitalIO_PTE16
#define UART2_TX_FN          3
#elif UART2_TX_PIN_SEL == 4
#define UART2_TX_GPIO        digitalIO_PTE22
#define UART2_TX_FN          4
#endif

// </h>

// <h> Universal Serial Bus

// Pin Mapping for USB_CLKIN signal
//   <o> USB_CLKIN [PTA5, PTE26]<name=USB_CLKIN_PIN_SEL>
//   <i> Shows which pin USB_CLKIN is mapped to
//     <0=> Disabled
//     <1=> PTA5<selection=PTA5_SIG_SEL,USB_CLKIN>
//     <2=> PTE26<selection=PTE26_SIG_SEL,USB_CLKIN>
//     <0=> Default
#define USB_CLKIN_PIN_SEL    0
#if USB_CLKIN_PIN_SEL == 1
#define USB_CLKIN_GPIO       digitalIO_PTA5
#define USB_CLKIN_FN         2
#elif USB_CLKIN_PIN_SEL == 2
#define USB_CLKIN_GPIO       digitalIO_PTE26
#define USB_CLKIN_FN         7
#endif

// Pin Mapping for USB_SOF_OUT signal
//   <o> USB_SOF_OUT [PTC7, PTC0, PTE6]<name=USB_SOF_OUT_PIN_SEL>
//   <i> Shows which pin USB_SOF_OUT is mapped to
//     <0=> Disabled
//     <1=> PTC7<selection=PTC7_SIG_SEL,USB_SOF_OUT>
//     <2=> PTC0<selection=PTC0_SIG_SEL,USB_SOF_OUT>
//     <3=> PTE6<selection=PTE6_SIG_SEL,USB_SOF_OUT>
//     <0=> Default
#define USB_SOF_OUT_PIN_SEL  0
#if USB_SOF_OUT_PIN_SEL == 1
#define USB_SOF_OUT_GPIO     digitalIO_PTC7
#define USB_SOF_OUT_FN       3
#elif USB_SOF_OUT_PIN_SEL == 2
#define USB_SOF_OUT_GPIO     digitalIO_PTC0
#define USB_SOF_OUT_FN       4
#elif USB_SOF_OUT_PIN_SEL == 3
#define USB_SOF_OUT_GPIO     digitalIO_PTE6
#define USB_SOF_OUT_FN       5
#endif

// </h>

// </e>

//-------- <<< end of configuration section >>> -----------------  

#define FIXED_ADC_FN         0                    // Fixed ADC Multiplexing value
#define FIXED_GPIO_FN        1                    // Fixed GPIO Multiplexing value
#define FIXED_PORT_CLOCK_REG SIM->SCGC5           // Fixed PORT Clock
#define ADC0_CLOCK_REG       SIM->SCGC6
#define ADC0_CLOCK_MASK      SIM_SCGC6_ADC0_MASK
#define CMP0_CLOCK_REG       SIM->SCGC4
#define CMP0_CLOCK_MASK      SIM_SCGC4_CMP0_MASK
#define DAC0_CLOCK_REG       SIM->SCGC6
#define DAC0_CLOCK_MASK      SIM_SCGC6_DAC0_MASK
#define DMA_CLOCK_REG        SIM->SCGC7
#define DMA_CLOCK_MASK       SIM_SCGC7_DMA_MASK
#define DMAMUX_CLOCK_REG     SIM->SCGC6
#define DMAMUX_CLOCK_MASK    SIM_SCGC6_DMAMUX_MASK
#define I2C0_CLOCK_REG       SIM->SCGC4
#define I2C0_CLOCK_MASK      SIM_SCGC4_I2C0_MASK
#define I2C1_CLOCK_REG       SIM->SCGC4
#define I2C1_CLOCK_MASK      SIM_SCGC4_I2C1_MASK
#define I2S0_CLOCK_REG       SIM->SCGC6
#define I2S0_CLOCK_MASK      SIM_SCGC6_I2S0_MASK
#define LPTMR0_CLOCK_REG     SIM->SCGC5
#define LPTMR0_CLOCK_MASK    SIM_SCGC5_LPTMR_MASK
#define PIT_CLOCK_REG        SIM->SCGC6
#define PIT_CLOCK_MASK       SIM_SCGC6_PIT_MASK
#define PORTA_CLOCK_REG      SIM->SCGC5
#define PORTA_CLOCK_MASK     SIM_SCGC5_PORTA_MASK
#define PORTB_CLOCK_REG      SIM->SCGC5
#define PORTB_CLOCK_MASK     SIM_SCGC5_PORTB_MASK
#define PORTC_CLOCK_REG      SIM->SCGC5
#define PORTC_CLOCK_MASK     SIM_SCGC5_PORTC_MASK
#define PORTD_CLOCK_REG      SIM->SCGC5
#define PORTD_CLOCK_MASK     SIM_SCGC5_PORTD_MASK
#define PORTE_CLOCK_REG      SIM->SCGC5
#define PORTE_CLOCK_MASK     SIM_SCGC5_PORTE_MASK
#define RTC_CLOCK_REG        SIM->SCGC6
#define RTC_CLOCK_MASK       SIM_SCGC6_RTC_MASK
#define SLCD_CLOCK_REG       SIM->SCGC5
#define SLCD_CLOCK_MASK      SIM_SCGC5_SLCD_MASK
#define SPI0_CLOCK_REG       SIM->SCGC4
#define SPI0_CLOCK_MASK      SIM_SCGC4_SPI0_MASK
#define SPI1_CLOCK_REG       SIM->SCGC4
#define SPI1_CLOCK_MASK      SIM_SCGC4_SPI1_MASK
#define TPM0_CLOCK_REG       SIM->SCGC6
#define TPM0_CLOCK_MASK      SIM_SCGC6_TPM0_MASK
#define TPM1_CLOCK_REG       SIM->SCGC6
#define TPM1_CLOCK_MASK      SIM_SCGC6_TPM1_MASK
#define TPM2_CLOCK_REG       SIM->SCGC6
#define TPM2_CLOCK_MASK      SIM_SCGC6_TPM2_MASK
#define TSI_CLOCK_REG        SIM->SCGC5
#define TSI_CLOCK_MASK       SIM_SCGC5_TSI_MASK
#define UART0_CLOCK_REG      SIM->SCGC4
#define UART0_CLOCK_MASK     SIM_SCGC4_UART0_MASK
#define UART1_CLOCK_REG      SIM->SCGC4
#define UART1_CLOCK_MASK     SIM_SCGC4_UART1_MASK
#define UART2_CLOCK_REG      SIM->SCGC4
#define UART2_CLOCK_MASK     SIM_SCGC4_UART2_MASK
#define UART3_CLOCK_REG      SIM->SCGC4
#define UART3_CLOCK_MASK     SIM_SCGC4_UART3_MASK
#define USB_CLOCK_REG        SIM->SCGC4
#define USB_CLOCK_MASK       SIM_SCGC4_USB_MASK
#define PORT_CLOCK_REG       SIM->SCGC5


#endif /* PIN_MAPPING_H_ */
